## Terraform data for `apps` stack
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
<details><summary>Show Validation</summary>

```
Success! The configuration is valid.


```
</details>

#### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>

```
module.s42.kubernetes_config_map.stud42_config: Refreshing state... [id=production/stud42-config]
module.s42.random_password.dragonfly: Refreshing state... [id=none]
module.s42.random_password.meilisearch_token: Refreshing state... [id=none]
module.s42.module.interface.kubernetes_service.app[0]: Refreshing state... [id=production/interface]
module.s42.random_password.next_auth_secret: Refreshing state... [id=none]
module.s42.random_password.postgres: Refreshing state... [id=none]
module.webhooked.module.webhooked.kubernetes_service.app[0]: Refreshing state... [id=production/webhooked]
module.webhooked.module.webhooked.kubernetes_config_map.app["config"]: Refreshing state... [id=production/webhooked-config]
module.s42.module.meilisearch.kubernetes_persistent_volume_claim.app["data"]: Refreshing state... [id=production/meilisearch-data]
module.s42.module.meilisearch.kubernetes_service.app[0]: Refreshing state... [id=production/meilisearch]
module.s42.module.meilisearch_clean_tasks.kubernetes_cron_job_v1.app[0]: Refreshing state... [id=production/meilisearch-clean-tasks]
module.s42.module.interface.kubernetes_deployment.app[0]: Refreshing state... [id=production/interface]
module.s42.module.crawler_campus.kubernetes_cron_job_v1.app[0]: Refreshing state... [id=production/crawler-campus]
module.webhooked.module.secrets.kubernetes_manifest.sealed_secret["s42-webhooked-secrets"]: Refreshing state...
module.s42.kubernetes_manifest.rabbitmq_queue_webhooks_dlq: Refreshing state...
module.s42.kubernetes_manifest.rabbitmq_policy_webhooks_dlq: Refreshing state...
module.s42.kubernetes_manifest.rabbitmq_queue_webhooks_processing: Refreshing state...
module.s42.kubernetes_manifest.rabbitmq_binding_webhooks_dlq: Refreshing state...
module.s42.kubernetes_manifest.rabbitmq: Refreshing state...
module.s42.module.service-token.kubernetes_manifest.sealed_secret["discord-token"]: Refreshing state...
module.s42.module.service-token.kubernetes_manifest.sealed_secret["s42-service-token"]: Refreshing state...
module.s42.module.service-token.kubernetes_manifest.sealed_secret["sentry-dsns"]: Refreshing state...
module.s42.module.service-token.kubernetes_manifest.sealed_secret["github-token"]: Refreshing state...
module.s42.module.postgres.kubernetes_service.app[0]: Refreshing state... [id=production/postgres]
module.s42.module.service-token.kubernetes_manifest.sealed_secret["oauth2-providers"]: Refreshing state...
module.s42.module.postgres.kubernetes_config_map.app["config"]: Refreshing state... [id=production/postgres-config]
module.s42.module.service-token.kubernetes_manifest.sealed_secret["jwtks-service-certs-jwk"]: Refreshing state...
module.s42.module.postgres.kubernetes_persistent_volume_claim.app["data"]: Refreshing state... [id=production/postgres-data]
module.s42.module.api.kubernetes_service.app[0]: Refreshing state... [id=production/api]
module.s42.module.api.kubernetes_deployment.app[0]: Refreshing state... [id=production/api]
module.s42.module.service-token.kubernetes_manifest.sealed_secret["ovh-s3-credentials"]: Refreshing state...
module.s42.kubernetes_secret.next_auth_secret: Refreshing state... [id=production/next-auth-secret]
module.s42.module.webhooks_processor.kubernetes_deployment.app[0]: Refreshing state... [id=production/webhooks-processor]
module.s42.module.dragonfly.kubernetes_service.app[0]: Refreshing state... [id=production/dragonfly]
module.s42.module.dragonfly.kubernetes_persistent_volume_claim.app["data"]: Refreshing state... [id=production/dragonfly-data]
module.s42.module.istio.kubectl_manifest.virtual_services["app-s42"]: Refreshing state... [id=/apis/networking.istio.io/v1alpha3/namespaces/production/virtualservices/app-s42]
module.s42.module.meilisearch.kubernetes_stateful_set.app[0]: Refreshing state... [id=production/meilisearch]
module.s42.module.crawler_locations.kubernetes_cron_job_v1.app[0]: Refreshing state... [id=production/crawler-locations]
module.s42.module.interface.kubernetes_horizontal_pod_autoscaler_v2.app[0]: Refreshing state... [id=production/interface]
module.s42.module.dragonfly.kubernetes_secret.app["credentials"]: Refreshing state... [id=production/dragonfly-credentials]
module.s42.module.meilisearch.kubernetes_secret.app["token"]: Refreshing state... [id=production/meilisearch-token]
module.s42.module.postgres.kubernetes_stateful_set.app[0]: Refreshing state... [id=production/postgres]
module.s42.module.api.kubernetes_horizontal_pod_autoscaler_v2.app[0]: Refreshing state... [id=production/api]
module.s42.module.postgres.kubernetes_secret.app["credentials"]: Refreshing state... [id=production/postgres-credentials]
module.s42.module.webhooks_processor.kubernetes_horizontal_pod_autoscaler_v2.app[0]: Refreshing state... [id=production/webhooks-processor]
module.s42.module.dragonfly.kubernetes_stateful_set.app[0]: Refreshing state... [id=production/dragonfly]
module.s42.kubernetes_pod_disruption_budget_v1.rabbitmq: Refreshing state... [id=production/rabbitmq]
module.webhooked.module.webhooked.kubernetes_deployment.app[0]: Refreshing state... [id=production/webhooked]
module.webhooked.module.webhooked.kubernetes_horizontal_pod_autoscaler_v2.app[0]: Refreshing state... [id=production/webhooked]
module.s42.kubernetes_manifest.rabbitmq_exchange_webhooks: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.s42.kubernetes_config_map.stud42_config will be updated in-place
  ~ resource "kubernetes_config_map" "stud42_config" {
      ~ data        = {
          ~ "stud42.yaml" = <<-EOT
                # API relatives configurations
                api:
                  s3:
                    users:
                      bucket: s42-users
                      region: gra
                      endpoint: https://s3.gra.io.cloud.ovh.net
                      forcePathStyle: false
                
                
                # Interface relatives configurations
                interface: {}
                
              - # jwtks service relatives configurations
              - jwtks:
              + # auth service relatives configurations
              + auth:
                  # Endpoint of the public JWKSet can be used to validate
                  # a JWT Token
                  endpoints:
                    sets: https://s42.app/.well-known/jwks
              -     sign: jwtks-service.production.svc.cluster.local:5000
              -   # Certs used to sign and validate the JWT
              +     sign: https://s42.app/auth/token
              +   # Configuration about the JWT
                  # Also called : The JWK
                  jwk:
              +     # The issuer of the JWT token (the auth service) should be
              +     # the same as the one configured in the auth service. This
              +     # is used to validate the JWT token.
              +     issuer: "s42-id-provider"
              +     # The audience of the JWT token (the app) should be the same
              +     # as the one configured in the auth service. This is used to
              +     # validate the JWT token too.
              +     audience: "app:s42:system"
              +     # Certificates used to sign and validate the JWT token.
                    certPrivateKeyFile: /etc/certs/jwk/private.key
                    certPublicKeyFile: /etc/certs/jwk/public.pem
              -   # Certs used to secure the GRPC Endpoint with SSL/TLS
              -   grpc:
              -     insecure: false
              -     certRootCaFile: /etc/certs/grpc/ca.crt
              -     certPrivateKeyFile: /etc/certs/grpc/tls.key
              -     certPublicKeyFile: /etc/certs/grpc/tls.crt
                
                discord:
                  guildID: "248936708379246593"
            EOT
        }
        id          = "production/stud42-config"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.s42.module.api.kubernetes_deployment.app[0] will be updated in-place
  ~ resource "kubernetes_deployment" "app" {
        id               = "production/api"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.24.4" -> "latest"
              ~ "version"                      = "v0.24.4" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "api"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ metadata {
                  ~ labels      = {
                      ~ "version"                      = "v0.24.4" -> "latest"
                        # (4 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (12 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "ghcr.io/42atomys/stud42:v0.24.4" -> "ghcr.io/42atomys/stud42:latest"
                        name                       = "api"
                        # (8 unchanged attributes hidden)

                        # (24 unchanged blocks hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.s42.module.api.kubernetes_horizontal_pod_autoscaler_v2.app[0] will be updated in-place
  ~ resource "kubernetes_horizontal_pod_autoscaler_v2" "app" {
        id = "production/api"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.24.4" -> "latest"
              ~ "version"                      = "v0.24.4" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "api"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.s42.module.api.kubernetes_service.app[0] will be updated in-place
  ~ resource "kubernetes_service" "app" {
        id                     = "production/api"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.24.4" -> "latest"
              ~ "version"                      = "v0.24.4" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "api"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.s42.module.auth_service.kubernetes_deployment.app[0] will be created
  + resource "kubernetes_deployment" "app" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app"                          = "auth-service"
              + "app.kubernetes.io/created-by" = "github-actions"
              + "app.kubernetes.io/managed-by" = "terraform"
              + "app.kubernetes.io/part-of"    = "auth-service"
              + "app.kubernetes.io/version"    = "latest"
              + "kubernetes.io/name"           = "auth-service"
              + "version"                      = "latest"
            }
          + name             = "auth-service"
          + namespace        = "production"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = "2"
          + revision_history_limit    = 2

          + selector {
              + match_labels = {
                  + "kubernetes.io/name" = "auth-service"
                }
            }

          + strategy {
              + type = "RollingUpdate"

              + rolling_update {
                  + max_surge       = "1"
                  + max_unavailable = "0"
                }
            }

          + template {
              + metadata {
                  + annotations      = {
                      + "prometheus.io/path"   = "/metrics"
                      + "prometheus.io/port"   = "8080"
                      + "prometheus.io/scrape" = "false"
                    }
                  + generation       = (known after apply)
                  + labels           = {
                      + "app"                          = "auth-service"
                      + "app.kubernetes.io/created-by" = "github-actions"
                      + "app.kubernetes.io/managed-by" = "terraform"
                      + "kubernetes.io/name"           = "auth-service"
                      + "version"                      = "latest"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }

              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + node_selector                    = {
                      + "nodepool" = "small"
                    }
                  + restart_policy                   = "Always"
                  + scheduler_name                   = (known after apply)
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + args                       = [
                          + "--config",
                          + "/config/stud42.yaml",
                          + "serve",
                          + "auth",
                        ]
                      + command                    = [
                          + "stud42cli",
                        ]
                      + image                      = "ghcr.io/42atomys/stud42:latest"
                      + image_pull_policy          = "IfNotPresent"
                      + name                       = "auth-service"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + env {
                          + name = "S42_SERVICE_TOKEN"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "TOKEN"
                                  + name = "s42-service-token"
                                }
                            }
                        }
                      + env {
                          + name = "SENTRY_DSN"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "JWTKS_SERVICE_DSN"
                                  + name = "sentry-dsns"
                                }
                            }
                        }
                      + env {
                          + name  = "GO_ENV"
                          + value = "production"
                        }

                      + port {
                          + container_port = 5000
                          + name           = "http-wellknow"
                          + protocol       = "TCP"
                        }

                      + resources {
                          + limits   = {
                              + "memory" = "40Mi"
                            }
                          + requests = {
                              + "cpu"    = "60m"
                              + "memory" = "20Mi"
                            }
                        }

                      + security_context {
                          + allow_privilege_escalation = false
                          + privileged                 = false
                          + read_only_root_filesystem  = false
                          + run_as_group               = "1001"
                          + run_as_non_root            = true
                          + run_as_user                = "1001"
                        }

                      + volume_mount {
                          + mount_path        = "/config"
                          + mount_propagation = "None"
                          + name              = "configuration"
                          + read_only         = true
                        }
                      + volume_mount {
                          + mount_path        = "/etc/certs/jwk"
                          + mount_propagation = "None"
                          + name              = "certs-jwk"
                          + read_only         = true
                        }
                    }

                  + image_pull_secrets {
                      + name = "ghcr-creds"
                    }

                  + readiness_gate {
                      + condition_type = (known after apply)
                    }

                  + security_context {
                      + fs_group        = "1001"
                      + run_as_group    = "1000"
                      + run_as_non_root = true
                      + run_as_user     = "1000"
                    }

                  + volume {
                      + name = "configuration"

                      + config_map {
                          + default_mode = "0644"
                          + name         = "stud42-config"
                        }
                    }
                  + volume {
                      + name = "certs-jwk"

                      + secret {
                          + default_mode = "0644"
                          + secret_name  = "auth-service-certs-jwk"
                        }
                    }
                }
            }
        }
    }

  # module.s42.module.auth_service.kubernetes_horizontal_pod_autoscaler_v2.app[0] will be created
  + resource "kubernetes_horizontal_pod_autoscaler_v2" "app" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app"                          = "auth-service"
              + "app.kubernetes.io/created-by" = "github-actions"
              + "app.kubernetes.io/managed-by" = "terraform"
              + "app.kubernetes.io/part-of"    = "auth-service"
              + "app.kubernetes.io/version"    = "latest"
              + "kubernetes.io/name"           = "auth-service"
              + "version"                      = "latest"
            }
          + name             = "auth-service"
          + namespace        = "production"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + max_replicas                      = 10
          + min_replicas                      = 2
          + target_cpu_utilization_percentage = (known after apply)

          + behavior {
              + scale_down {
                  + select_policy                = "Max"
                  + stabilization_window_seconds = 0

                  + policy {
                      + period_seconds = 15
                      + type           = "Percent"
                      + value          = 100
                    }
                }

              + scale_up {
                  + select_policy                = "Max"
                  + stabilization_window_seconds = 0

                  + policy {
                      + period_seconds = 15
                      + type           = "Pods"
                      + value          = 11
                    }
                  + policy {
                      + period_seconds = 15
                      + type           = "Percent"
                      + value          = 100
                    }
                }
            }

          + metric {
              + type = "Resource"

              + resource {
                  + name = "cpu"

                  + target {
                      + average_utilization = 75
                      + type                = "Utilization"
                    }
                }
            }

          + scale_target_ref {
              + api_version = "apps/v1"
              + kind        = "Deployment"
              + name        = "auth-service"
            }
        }
    }

  # module.s42.module.auth_service.kubernetes_service.app[0] will be created
  + resource "kubernetes_service" "app" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app"                          = "auth-service"
              + "app.kubernetes.io/created-by" = "github-actions"
              + "app.kubernetes.io/managed-by" = "terraform"
              + "app.kubernetes.io/part-of"    = "auth-service"
              + "app.kubernetes.io/version"    = "latest"
              + "kubernetes.io/name"           = "auth-service"
              + "version"                      = "latest"
            }
          + name             = "auth-service"
          + namespace        = "production"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + allocate_load_balancer_node_ports = true
          + cluster_ip                        = (known after apply)
          + cluster_ips                       = (known after apply)
          + external_traffic_policy           = (known after apply)
          + health_check_node_port            = (known after apply)
          + internal_traffic_policy           = (known after apply)
          + ip_families                       = (known after apply)
          + ip_family_policy                  = (known after apply)
          + publish_not_ready_addresses       = false
          + selector                          = {
              + "kubernetes.io/name" = "auth-service"
            }
          + session_affinity                  = "None"
          + type                              = "ClusterIP"

          + port {
              + name        = "http-wellknow"
              + node_port   = (known after apply)
              + port        = 5000
              + protocol    = "TCP"
              + target_port = "5000"
            }

          + session_affinity_config {
              + client_ip {
                  + timeout_seconds = (known after apply)
                }
            }
        }
    }

  # module.s42.module.crawler_campus.kubernetes_cron_job_v1.app[0] will be updated in-place
  ~ resource "kubernetes_cron_job_v1" "app" {
        id = "production/crawler-campus"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.24.4" -> "latest"
              ~ "version"                      = "v0.24.4" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "crawler-campus"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (6 unchanged attributes hidden)

          ~ job_template {
              ~ metadata {
                  ~ labels      = {
                      ~ "app.kubernetes.io/version"    = "v0.24.4" -> "latest"
                      ~ "version"                      = "v0.24.4" -> "latest"
                        # (5 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (7 unchanged attributes hidden)

                  ~ template {
                      ~ metadata {
                          ~ labels      = {
                              ~ "version"                      = "v0.24.4" -> "latest"
                                # (5 unchanged elements hidden)
                            }
                            # (2 unchanged attributes hidden)
                        }

                      ~ spec {
                            # (12 unchanged attributes hidden)

                          ~ container {
                              ~ image                      = "ghcr.io/42atomys/stud42:v0.24.4" -> "ghcr.io/42atomys/stud42:latest"
                                name                       = "crawler-campus"
                                # (8 unchanged attributes hidden)

                                # (12 unchanged blocks hidden)
                            }

                            # (3 unchanged blocks hidden)
                        }
                    }
                }
            }
        }
    }

  # module.s42.module.crawler_locations.kubernetes_cron_job_v1.app[0] will be updated in-place
  ~ resource "kubernetes_cron_job_v1" "app" {
        id = "production/crawler-locations"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.24.4" -> "latest"
              ~ "version"                      = "v0.24.4" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "crawler-locations"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (6 unchanged attributes hidden)

          ~ job_template {
              ~ metadata {
                  ~ labels      = {
                      ~ "app.kubernetes.io/version"    = "v0.24.4" -> "latest"
                      ~ "version"                      = "v0.24.4" -> "latest"
                        # (5 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (7 unchanged attributes hidden)

                  ~ template {
                      ~ metadata {
                          ~ labels      = {
                              ~ "version"                      = "v0.24.4" -> "latest"
                                # (5 unchanged elements hidden)
                            }
                            # (2 unchanged attributes hidden)
                        }

                      ~ spec {
                            # (12 unchanged attributes hidden)

                          ~ container {
                              ~ image                      = "ghcr.io/42atomys/stud42:v0.24.4" -> "ghcr.io/42atomys/stud42:latest"
                                name                       = "crawler-locations"
                                # (8 unchanged attributes hidden)

                                # (14 unchanged blocks hidden)
                            }

                            # (3 unchanged blocks hidden)
                        }
                    }
                }
            }
        }
    }

  # module.s42.module.interface.kubernetes_deployment.app[0] will be updated in-place
  ~ resource "kubernetes_deployment" "app" {
        id               = "production/interface"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.24.4" -> "latest"
              ~ "version"                      = "v0.24.4" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "interface"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ metadata {
                  ~ labels      = {
                      ~ "version"                      = "v0.24.4" -> "latest"
                        # (4 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (12 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "ghcr.io/42atomys/stud42:v0.24.4" -> "ghcr.io/42atomys/stud42:latest"
                        name                       = "interface"
                        # (8 unchanged attributes hidden)

                      - volume_mount {
                          - mount_path        = "/etc/certs/grpc" -> null
                          - mount_propagation = "None" -> null
                          - name              = "certs-grpc" -> null
                          - read_only         = true -> null
                        }

                        # (18 unchanged blocks hidden)
                    }

                  - volume {
                      - name = "certs-grpc" -> null

                      - secret {
                          - default_mode = "0644" -> null
                          - optional     = false -> null
                          - secret_name  = "jwtks-service-grpc-internal-tls" -> null
                        }
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.s42.module.interface.kubernetes_horizontal_pod_autoscaler_v2.app[0] will be updated in-place
  ~ resource "kubernetes_horizontal_pod_autoscaler_v2" "app" {
        id = "production/interface"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.24.4" -> "latest"
              ~ "version"                      = "v0.24.4" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "interface"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.s42.module.interface.kubernetes_service.app[0] will be updated in-place
  ~ resource "kubernetes_service" "app" {
        id                     = "production/interface"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.24.4" -> "latest"
              ~ "version"                      = "v0.24.4" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "interface"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.s42.module.istio.kubectl_manifest.virtual_services["app-s42"] will be updated in-place
  ~ resource "kubectl_manifest" "virtual_services" {
        id                      = "/apis/networking.istio.io/v1alpha3/namespaces/production/virtualservices/app-s42"
        name                    = "app-s42"
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
            apiVersion: networking.istio.io/v1alpha3
            kind: VirtualService
            metadata:
              name: app-s42
              namespace: production
            spec:
              gateways:
              - app-s42
              hosts:
              - s42.app
              http:
              - match:
                - method:
                    exact: GET
                  uri:
                    exact: null
                    prefix: /.well-known/jwks
          -     name: jwtks-service
          +     name: auth-service
                rewrite:
          -       uri: /jwks
          +       uri: /.well-known/jwks
                route:
                - destination:
          -         host: jwtks-service.production.svc.cluster.local
          +         host: auth-service.production.svc.cluster.local
                    port:
          -           number: 5500
          +           number: 5000
              - match:
                - method:
                    exact: POST
                  uri:
                    exact: null
          +         prefix: /auth/token
          +     name: auth-service
          +     rewrite:
          +       uri: /token
          +     route:
          +     - destination:
          +         host: auth-service.production.svc.cluster.local
          +         port:
          +           number: 5000
          +   - match:
          +     - method:
          +         exact: POST
          +       uri:
          +         exact: null
                    prefix: /webhooks/v1alpha1
                name: webhooked
                rewrite:
                  uri: /v1alpha1
                route:
                - destination:
                    host: webhooked.production.svc.cluster.local
                    port:
                      number: 8080
              - match:
                - method:
                    exact: POST
                  uri:
                    exact: /graphql
                    prefix: null
                name: api-gql
                rewrite:
                  uri: /graphql
                route:
                - destination:
                    host: api.production.svc.cluster.local
                    port:
                      number: 4000
              - match:
                - method:
                    exact: GET
                  uri:
                    exact: /graphql
                    prefix: null
                name: api-gqli
                rewrite:
                  uri: /
                route:
                - destination:
                    host: api.production.svc.cluster.local
                    port:
                      number: 4000
              - match:
                - method: null
                  uri:
                    exact: null
                    prefix: /
                name: interface
                rewrite: null
                route:
                - destination:
                    host: interface.production.svc.cluster.local
                    port:
                      number: 3000
        EOT
        # (13 unchanged attributes hidden)
    }

  # module.s42.module.service-token.kubernetes_manifest.sealed_secret["auth-service-certs-jwk"] will be created
  + resource "kubernetes_manifest" "sealed_secret" {
      + manifest = {
          + apiVersion = "bitnami.com/v1alpha1"
          + kind       = "SealedSecret"
          + metadata   = {
              + annotations = {
                  + "sealedsecrets.bitnami.com/cluster-wide"   = "false"
                  + "sealedsecrets.bitnami.com/namespace-wide" = "true"
                }
              + name        = "auth-service-certs-jwk"
              + namespace   = "production"
            }
          + spec       = {
              + encryptedData = {
                  + "private.key" = "AgCYj3HKJUZ9r4QDQCdraWOVfG70qbKMSjAz+pt0vI6SuTKieZsn9Nsrh/zqwQVqoIWhYSL4/JH+opH2/JelE5AbdtQkt/ettymWRGA9fYz/d3S5gY8R8e6FWLdzMBfhZMsuDTvPrP4XY/G73LueQWNL4laX6+765CE9/uzMVzwpG6txEnEGHCIKvq6RZLpudyLD/JU/U3SEd+PFXmoWI72Sal45H/f0wOdkYG4VkNWsvhGeeHDg+4VlE0apfwD/GTc9IZBTPzZBSayonu+UuIDVDSDXlGuSZby/tIjQAy41v6oBnbXvonj23Ni3NfCX8q8zuIeqjFctwC16pxFyU1sKdVZlh0DBnXjI9UXQveY0xxtrXAdscLSCVbqa1tTw5j3lRyfQOBNcRgIS9d3uJ+7dIKCSHvWB1xEkjIenI2ZU3GeQmPnaScdFhKBZjTp0QJNeNewka3LA1bM4Hqgn8zyX4FmscneNATtc4opAmRxXWXOr16o5Wo9F2w2QoLQIVBIisJymVtA1w1Kp4y/JEQfGnqDBnFo7+dX09IsIjOQryAHHxctjQdVBFt6WRJb8+lPr/41sdSuCmjxHSFo1/712NCC3UrY6Wb/zL4uszOAB2fYDmOVpckZ9mbsvhYcETeBxIy5ck5+PjdzXT9cJoZ19PKiz+DWnQlL0s5HMC1qlPFKZgggCGADQfitqHQGSklnVPTEZQdzyGMPhTDJsGNEkME1vWZvG2q+W5n0NVHBq+/kJVsdXL30YtgqzMsudAabejDXn8G/XVPTRU3+r8ETzIX5ea3HKKCQVvjnBBPz4pzATNAbw0OguyhyJjkhjSZbq5gDSR3NBpTcGMDqA9q/zTiPLf0Y1J0eTssRa5RCtLQxeEM1LN2pKQELV8/jl7NbQhFgG2EsAYEr6Z2uoIRziHfx0DmAjf/JQ0L8y7V+Xq98QdWV2XCIhpLvFZZm8WyDLwJ+JMDpOW7J0DjS7/gzT4Wjj3EA1oIVbm1Y/vzV/lyMAPHqcvYs75P4LO2MBNS5vlYe5ThgSxLvK2RD5pk4xqe/ZIDndCwdaC5vRE94n9kEOuCetxFYeKidFWTJLxFN4jBpQeFvY7olKpINAp0NfNeiOkMud5fTSgoE61mBjIZFzl1uOk+8uO9TUofZflebHqucDaIdv3B7M83ho7XJLyVt4JZ5QkHjoUEd6B01534wt2sc+S9q+fco4hmc3Qc7gYJnddLaEejoAH3+yGD8LCYKEQoYyqlUtQMYuOODauys/xSiFFXELbm//+q9Cg0qi6PuuvS9Ndl+6HW6mYzjR7oxfUPQyCYzp5kfLal5p1PC1yaaNi+77DH7064omX2rJhtAybkaBD5bmfj689tPfRaYOhEL0anP3zp/6QX1QEnPQKmrjQvh0nnXx2o/4DKYqy37TweEPPYj/gjsfnmKE6UC4pf2Aks2CB+hyyNJnOMlCWJFcs5LdIEPr1q3hCFJNLlr8CllGP6o3JwiQj3hXx3aDFC2CE0up25HmVDAV119p5kc8IUcbT272vETVeQSbzyFM8NRaeF7rlgA9mTZPC4Ejo8NdsgrijuhTxLg5XdbzOePPTDc7vZmt58GqDOf46ulIsvUlvwJkamP7pmaZ/SxN/CzLm9zixYwrjBGadshZhqqjjz9ZUd80kcZUh0UIQh70xEyXrqPeu8VkWN/xhqnSxoolFH7g7xfmSbOPfb9s/I3ktS2Hqr/rcKK4zWfxx4Ac0UtxAlRDSYsFF9LYfvuDbnun17rfRRhbio3ZonYEwDOKM7kAX8numLRf5tNH1gMql4NakFGgNrW2+aWUb/S/o8eYDPs9XZbVzAsfGIVzIueyXv/9SppMYfWtEvpGoMwoi3XzhcQxGFvZmoTysgPkGj1qtoM/JdhHOjokqFyvAErHnFPbPf/sranZRqY8mEEhXVi1NFH2di7Pa+6WM2v83JuPIF9CI8cebPXQTnFOWu9WUHyc9Q5tsUY8X7uUrbJyadvCXQI2YrMjMafX5JomzUuOXZVcKalYukTyyhPtCv7UzsbqSSqoI8SKyGJI5HOsvM/r7msZAsqNJjXbbJb3g7+Y25hVPen/D06uHIfc0SftDQZthyIhlWDVMEiAJ0/akCGnWrRKw6AYVPqGOr5+JYaec/T2hboMzsRTP+g4dk6hMXPQOMLJOXzQym8WBFtMkLDpnQ1Ky3gHd/CBCrsKAW49LKHUf9b+eW5fZg/lCynMyHl0MsBMdIcuu/6a1zVBL1+mgGleqnDRxTF3uwW7B+G6jAv+JhZJSHZUg/m41xRD/eD20pM6d1yURWoNhi7QqEuFC7KxsmwZgv1BaEKtbGXDLSGFwIzq8EPvo4BQ3HQy3G+o67SNgV/6toI5EV3S6NKIqp6tsnTzyChBSgnlQZyOXfCutopZW6P4IhM2TB/peG0/lM8yiyjY35Lw8LMqOFmeyFDUwNP6HmmeH9+z5hxYj9k54hiiPyGSih+k/As7428K1UlbaQknjbfKL6Fe59KmTGAM47BUGDlworTdAk+9aWFO7gF4oBlD/GHkwkl4M6S7VXoOE1771/1hb8XPBSTQpGioYPkHErscM1xxjgJlSsDPOhI9tmzzJe+ciE/E3k/1I7dFlJjMYbTPm/l4ADb4nyVF302ctFheFxJPJnbIc9oL+JMyi7kVu5Xtl0xf/N3gFUiHqvWjo+FUwCnkWUSmM9EYoy5xtRBSz5eHgARcbuHt4fARqGuCImyPNBppGwdUoqhmDFIq56zm93wcDdd2mo/5OGSgcnnOkSLBf+X9WuqQEcEz1XVZW8oxu3iYiWb6pdoDzzfYr7Y1u9QHcRTrW8VNtYpt7o1fO+olT6v4E+vyZqe99k1lUPWB/gqkuwFth3qIsch2nJbxVWdO9jiFnlzrbLOfIBvhJqCjtpGg/QrQ8NUAWdZ3gKQa240YnOgjcHGWVmpO12gf2k5jdSotnru6sdsNaSlaio4RI6Q81S4JZd0in3FXQJn1oBU0GaHXIEM51HgXHlFz5R5Oio76iNIbdrJuvFfYMZfmcw2UEKbdUycyblv2FOpx4fvAQneBL2VcdZ/DR/18qExPJBJdTKyLitiwClEC8z8pTPdmxSHKprBQgwhnGlyOSrL961eHBS/co6d9UzJ06igb6KnC2vxlzPDhVqPxeIkMitN/bp5dTPdCBeZnOX1PShof04XZDlmbynyULQZRlC3DgdghPX+JwhbhsKcJ2w5laxKwMerbC4suxMeQ6Eyy8ha04QRRue0fKjQq0uDg3lLRtVs+PPfUev6GudX1yxn3VOLTghF+uOVpkL4DVVPJK0FJKKVRABSXsbkJ+x83hJOhSLu+2wJRzj8SGocmodFHHFj9ZINPMmJWL23liYKWGAztrX6j5Rx3k1Cqt1ttm6wYcwGHYvfBUP7FVyoP6vVGCfWT4XkGD/fCltIuDuf+N3YCf3iYcJqdZOxbwNnz4nl1vsVzwRZRM6rjNMDZmkETBNMVJU4dj1K7AtsyljvzeM1/Upk3ps/AJt2uJBd+S8+yR+pTcCaa3zivxyOJw+jusVyevgHEuhOKtoUAz4g8kftbWaRcp9FxuOCdJA0DxNwrMokFu/oktNvLertHUobsh1+rz2WfjyEcbmEkXRo+LILDpw3Z/LKeEvKXmrhnxoXV+oFejm4g4N5DGroB056plw3CduI/qUbDPjZyK1SHyaDKiUfx2VmN27/LRwpqKYDiu3D2VIfqjTJsEXtBMn+3y+ICWs+b6kUJ2a3MxM5AeS7Iy3Kt//khBJB24CXOhv6+wR7/bUyHbGZdZ0W56Q8sFD2YrgtFJ2EmJ6kSgbrCOoqi7qnPvTmql97/UrCuigVysuURES4yGq6ot+hcb9P2TYif00k2dLefufpGv+TSNKEs7yMXUORctMBfBQGl/nm8FH4UMB30hG5p5Yz6On5wkEOjyRLW0j3ULzO/1DBM9cc+uUfWwvgVT9kjfzVdez6oUQknnBCJ6dTaB+vhe8735cveBvB97U+RzJ3tFhLEKoMF4hNnY4hGLfudU+X4JnKpybK/r0lDuMqoj7EUHKSKesxsK1LtsruQkbC3fJT+2vI35wquSx9noFrOMINtBKk1gHCemcr2NHvdX/zVSRpzqH2/YntIg6R8qdoQFwa+MjpieXKZskfkjdwB3EO5s5f9Sqlm/h8A9l88Sht1BRvUShXzHqQ5CeTIHBITVCA4qrwbGKI1STJ/ux8bK4Gi1tNZ4b55Adzri02MoHdxZx6f1Nmz0yE+3lG9iixFoGmauQR22sPjoO6iSeqXRJdt5qBYRq58o8FeZJ74+ZElyBZSLivnTuyXqcjiHLIS1AVqwxzL0pYshOU4T7pbBjDEfArluAXu3tGFCNtAEZ86XFjIkJZnGzdGGFGJ8BeS7YL3n+BliVcCh7hBR/Zk1EjMm+nCNOhpjV6Mf3Mxs08Z4lXLXRdmwEhbJVDrIjE+q2rIfnGedPctbJOS928rz/VSpOO8H6bF96wFsCSujuDRatkJgPVo3zSJd3JhUsvY1dPoDcnfOQpcm14pkTY5VODbthO2lyGVOnjYWqIjpJhg+/pzUW+H98jUqub5TvJwcTrii4TobhR8tX1SDHqdxrMJe4Jwl7fz3C/vcieVzMXBf8izUhcWgKy34596U9cvyj5ine0xbpKcWk74s4iOM3Drndfoyv2hPi6f8AXGxC2NnYy3O45qbgP4Ol+P4dAegRRg/Lll3QxwqPLPRAkSq4ME40PVEKSKtLM594ejU0+T8m7T43b3N5ntShG9284Tq8bLu/vOGqNsFgg2sngnWbrpEg5iUgQ+jCvB9Gxuuv3uxGK0mGg20JGPRBQf7FIv4Qq+cSw0flj+4AZaq52HeeSW2/T/Vz5qDJzt70XO2Hvv3BymXtIkAKLy6xryQoMlTVu1gcBApIKSxGS/Ay76cMRisyHw33WUFZEY5ezUyFLIdCCmGiluLeUt+5dc2gSrIvssoA3PI67Ty68WyAuxq91VzirsnRp+YO/aFxrZe/HRCZFouK2aBD71OB5WeVFLkfnQFtbU05adTjbGlfuMzgH9x2r84Ohn1rjjVy1b2UsgMCyfoGRPkQl1h3r+toU1msnzPm28aZAsJX3yojJjxCd8XFJWXCJgg6P+d2RZMkOatRfry7fhQLxopCTKsnM8W7eWJGNpP5MLfcdy99rSCLzA9HiHHSW9Kqs/nOMHIiBOsg9Jz+793ZdpqCEzKFYYPuJ+kHMphf3auibKt4IYTd7+ziB3UBn86EhpViqSVbG3GitQkQw+fQEKe8mj0r/QM257n4/2BX95Jf4BhL2QJ6mIZ45KKWv2q3Me5TfHy94Pjzv3DdAiIJohc7rKu43lBNCbWw8pfC+4fFAAUOo5JcB724smVtJXWBrk3hNm1K6gDqak2CT9ybAkKNUQSUnsb/EuyStfOSa4eOSlM2+VdRgOexbksP4s9NI6p98OxMCeTE4J3O8Knla324IiaT26ViGznbImzZ6uucQsbIxx8uspNTQNbdrUnD9T9id413tKu2jlUd0CEpQy0NnGAqj0oQQ9JarEKMOEa0aZx8WYNPKcF1cVEAp8b8Dj/QHGEwFMuqI1+lxsEVFheMUTH992Eq3neWAoOjGn59lv4E0oJ5M/bWGyFBW9ghFbYdzoey47WyySIP9yK61I6JkvjyjKUXZ31nvqYzLVOL6k1CSpF+ySD0eHG66zhda5WU4DZvTAv8lSNHoh5ePOzxCn1wEO78q3JYeXQtvcuYZj/71mVmBVSzJoAzYnOH+N0SJvKSifZk5n46BYZSFyWtPlNWanbbOa/P4ypd2Yi2r1LxCYylgxD3Kiu6snXPRqVte8EwHuJRlyoO/hUg6Aqs+SrgTcdMeIZ8c1O4NGYIesP0bS0r3FFPC//V32+MYd4nqCCsS6q2EC+0hZsq7LHINRnuirAdd1W3r16rlbkPeSFERcf6I+xJIb1GNob8ela6H54FpvuRHz8oEHeZHmjY3+LTD+b+d5M4ZQoxVgnUuuWyhruAH0VBu239FtjjGWw//V355mSOqM8W/HhUgS5qHWxpc+W0baQhXrXOgCt2UpBUziHsXUOGBjdbc2exHFkd/pu9ER+a+8j2tH5sIiJLCRlRPCP9QwTeHoVW0Yg2ortutSe+slz7Dq5EQFL9UhvssStXUAo67bl893iEzOZ5pXIrb9lxI8iv2YE2ICVcQ/OZx0WsFftz9ii+gYPdUsKItXA08L2nA8CIDbitukCZVKXuHU53C488ab87yZy7pdBkHg8vPOT+eSsaSDf+9trfvHb32CFcOn70eK9gtsHI/+aqmU7BpI05gDSza0kDROtzUz/6Vin8bCLmMHVDEGgOOmqyow67+aYAxdQZm/BpMXKg08bM1BC5fxhz+ph4Uo6BUyywbQ/yauwKs3MWS60cGjXw6CWgxpIh1oMKXDBqaNLgwEGeDd3QKO5yrIE+hFY18erzj6mD/2HGPRClequwM7EqzmjoEQlsOpwG3vFvArnp6hyclR5KIuIFR9Hj+2XeJsBmPeHKkogi/grpB9hKQIA23x9lodgHr/QdIsdtJy9fd3EBK7dy4bYBPO6Lg2x7bpsaNNx13pYpried/EW33mBt6DMQCYLpL9Pn4XqbC0pHFTO4VyFJExzOz27sbq1D/E3BFcCxn7BYBFVUHX23QB13O/IL2u271rvwUHNx/sRW7whKLhfvZEmQU2qlUYsk6f2i3GLwy9535A5L0RCditO2/BzugvtIAy2mUSGCSHjEHVFUnAwNcbktnzVjYB1DTOD/oMm2dQqROyOONnY4GUM8vdK2YF3HvXo+z/sKkIaGY0I0TxjsH2edy86uYbbBr0fG8qVjeIfagujlFrMmCPCR2UN/IeHcwubxpwJQvMoKvPIhX5b9PL0dOzwPZ+NR8MTD1ir/+/RHltL51Ahw4ehmmqLgUi08wEHekucoe/8bBJhnzaVUzcJUdoKwEjBdv21eF/jLFDsJVyYm2rwhFUzmBJiQEph1iTNZ6qgzHhfC1yuncCyqBYtK4WotcI0Lab8zS39JNOwXeUSAfIBiF9gkA4rjc8HkSw3LfQ/oYbdxVgNQ7cQi5yDRVc4E928+vn7QCk2NblN7nVWMEjxjpjBVdNDXmspmyvkEzlIJ8pgfPAgA0kZpzu7EJD+1IlLhqVz3QKAMZdQ5JR4tZGyVe2km7rEdwA1LOlDDOOz4fVHC+UJylrRR1/MxjNX8XkXqpttL+kBbaUz0BM8povWVQpXo9KfvOh7nyI/MNxzNQaq1rZEnVQSRmrxumKezH0KUEGE3ZfebPY1yqnu9RE28IGe/l47VQiNO2k61/lIqUFH9dhrrnyigaFx00ugw5naRXsoqfztInqQZM5ZKjgjF41FJB2RV+F2qd/juHqYESkczo6uFM6eh4TdDyftCnbVqC1FXf+hbq8qZGd42E6ouyz6jpa5ANnR/A2MSN5y4iSv06mMMnKb421MxSPX3U51EMz2eX7cvydyClhIPZWZCJvzJmHm0ioVV+qqLpal8e8ATfmeKmekRQsimW8pgkgSplcZXTrJS63+14Rq+ILe9bZi6rLkZgyASYW+VQaVSsKaOXH6W/LXl+fRQQT/QgkZbSKusMPb1YNJiCteTwva5Xd/qowBA0tZ9iTg9ODJ3rMqeHQHdOjSQu0QBxrGC0LXaax+PNDbW7u1sntp7+GnryiYlDWJ5QAYfOrur0EWpgWN1EbAhladgU1wlpLEfwdn/kbkGg7Hvhp7vOG8/kQyKPDfFYvntiJznXN8tYdxCruDQUxYPGv890z1JyvFKyUzdP/KhJj4cD62yocXRsDlXnzuVslCP0vn/i2iU6g/EViGjPPU4yJGRD4tQ8v0a46j8+qdW8/AqEd4qH4MSpr8mnNQ63mqZFXFCB8j+1drMDxHthfIVmT8gozgTMGKb2he1Y/jmHfKK/Yy9P/4TXlYJHzzLZpNUqKxucQJwom2tvEAm1y3fA0ofStE7pI18xQ0FYrRWkkdSu/1HZR69ZlSraICmVq47E0DW81huAI+i/JPieZCJXLHN/YRoo8UNDd8VclMsKP1Dvv6JqzFf3XkovO/9qFj6+U4ny5/bMyEFYH3c4tGVIMyn2t4fTgyd4ribZT09i9XEO5nOdfAdcA0xpVBWiUkB2jdLefvRS7IdpFIR9oBzTJO4MkOJn9649jsp/XTixax/kDWd3dWysMJGh2g6Eg075pNza458/y0plQ+ypYmV4mE7cHMernmRBk5DJxjiHIpKFTvfC7qoOj7IShVoWykGwM4r9ZaH5znSeI/jAwlQ5MfH6E9A3RNHYmhhCNb4jchfnwTFHUnz64GancuYWS4shvo85F9BxRkgB0GN7gb968tLGgbJkp5jgwvVUJR1g3jFjm7ThBt1Wjj6Ik2hc++3JLTCQ6q1zOEB7x8qL9cJk/dYBN7qqvXRNnqjKA+T7ftE+T8csKU5jp+mL8juEAZFX141JWj93nRvImXRLYXiLsDjm72sbP/t07tnYe00whsbrp41UgycGDI1RMKszTYY9cUPISYjwBUvkdMt5u9vqy+bCeknBvnSeScYOYVEatql5Rt2zAuMbiqkapuCsRpi4zcCj3uZFq9CQkyLClQ4tqA/CAIln1Lq4MuK4kzFXPCsPB0nWU+6JCX7HRviusHihys0FyzWHAZm3oEaV+UiB8Wh6QQsPDgROvBP7LGVdmqgKH68jYZ5SFJr8slzLh92sLwt3zutgG8k9oanCKCyLTANOhOH1QO07YBd4oz1Nco1gZG6aTPtEhZ3a2eQfwtqlIdnM1F/7/EfbyCRsDZJqJtM54lkAUL0zhg4cPMhafZoJwXZN7DhJtKaGCnErkcVjKLw7j0w2fOenrbE8rMktOPLEoXB4XRajvak5SiYngK3HUXNKyR7WbYvNcV4tcXOLUlEg9p27Nunh1cxxhI05jLbuipVfADL7sX3c2Ws2K+An0eEfEGi8FN1TiKXytu+6K3aweDY6+/julq/nkpBbi2QAca2DURF27yQPgNUK76kDllNYruvE9aRSCEtmefFa/WbwLSI5vfqE9tQTutqBMnFUewRh2BLJAouNXarj3QXVflXNeYdIA+rrp/3vl0PtnscbSqU+5TEsmYbqOZZLi1aMRSq0Wieju6HZPbxE1gcbanUH/cIhYdlyipg/q+r6YeKuo3kROwAM="
                  + "public.pem"  = "AgAnuZgIj+CO66gGtXNvgTGcE8rWDFHuxcXtr5lhSzV7QD4yxkoo7ED5k2SFFJRxdGkRZq0/bVpObcgVpefimiHliuNCSUWCBbJfChvt5ACuumZHmWE6SIoK+4a4/2qObX+Rfh9vOwjbj0ScakmSrbsrBebwUthIO8APULkTXpaxDljPHOt+bqLe1agDd1qY4KCTCDpbgnLhJ4Fr9zzy1VqC0wV/yh86yAHgnLgicdjWXIOvVpFQmjvLdo4ZLnElEa1Yw9qQwY3KU6U+DmixwaNQQmlkd4ENkADAv9VjStUcGtS0MNTlyRpTw9DHPnFslQlhIK3//n6SBDtGwKv7CajkzxsuumYmehb+HwvgqQ8yAuUND55VcEPGieOWEdYzyaTRt/DWa4B5XLYC8VHeYOLmpJuvwkRsvdyB4iGEy2ymMgJ6gxmmTdG1ow7ojlKWoJI3dNDX8j8ppUPAk3fI+IwDDkEtkMwUibR3QaEk97jHybMkTkpjUuPuy39PZwRlkWd68pUlKjH/3AVBaUz8Xl+m46IVX+9hHGjmWe1gOxq+lsiXtjHulpn4NLgZdZNkJiDAbQy5mjYAEiglREpIwmXal0c/BACU9xv2i2ucPfUtHtfEFPeynNBIcRbifKDe1CWB4QqV4y9qW5AUlu8mGgWX1pshznEm7TCykWH19DiZhLsox5WXlzDuMBYvWSu4vIdK3f8XaotCKXlwgXEwTU/ZJYEwbKdSrd91oSJqc53L+scezfjU8aRn3N+ICFBqjXfRH3zEOq2ZGYs0rQFFoojA/DHcyCNwupaWLY71JL0eUDFapkO63TIW0pEEbRwC9cB6YWiVrWkFAhodT3VxXkvrnfjiyH3v/+ZkUoP7RPT8CHQLWiXB/UeMdKk3cHUXtBnsCYu0/gu3TsqAPQEwNj63hyH5fRhf3/Ns15d7gBK/kCze/DNATtAo3tf0S8lwTIa2WCrI2g6qYei4WL3HrMT1ZnwzXj0Y6OCdvh50yV080UKnvaIgbOUtgF9V9ov7zZ5qsBax8kEFbuU41jQUlYjgYrTYiT23L3LT6dk/qrYKX+/RiYP5AHCX4RkVhjCk+nAFaB+i8KgNH69mRXqJf7HS9VKICtdiJ7J0bBOv6GFzCEBCWI9gddoO4d/ddpGPNYCQaL9vbqmglyAy1FN+n4JF9mjUFMq7mz50EAaKlHOl8ehQ0keIA8sSrzre7kBhgiLVZ6Hhzmt/ad14xyvvnFDIV6Y13N3aYefan6YI1e4ZEneD0gCozC81KwG4RCGUmU2nXWrfhl67Fgdnr9zeifGUXEwklfW09kp9DWTqKHpFyu9ZULJUTp2hxZH3b/N0Mllr69U1JhELgkwfLEWMim6myUeTiHLo89IzD003YLJ9VDcjFET/QD/Ar6vTIrsPP/8l0E7sJKWM22t3ZS6jX0CRNXbzwX5DQPeyVtzaupBCzBaK14feecde9uochnh4D8xF/E4dTwa4r7O5LcT4wXLPImxA7xfblXxY9eja9xv84jn3wLjA9I4VvbOnTws4oifVghtUd0TwcH+43RQDzO9EyV3x2WUgdWmN809qpmZ74UxsyE7Q2FRSgKKC2Zm8G6Uk+N9iidzJt19IWzgbQsTH3c912Odcm1RmE9ceMWQg+lHsgJsZEP/AzPccaX2bWTBJsnvpWiwl1touZq3iSOImv0v5b0mAfPrZTuOaSAkO7iPCj8BV0Fo6dwW89f4KXTRevNBfADVi+ijjhDtoz5JiZzSMct/vAcFOdIvSz1g2U6cdRH9H/34SgV+aNeeDLbkkgOAFO8IUX6eHNOldEilC0xzGMOc8byw4/3Ix53N4E50sXbFL/M+uZwOVx+Jmdb901pIMhQ4Z+3XLheAp+ZXqaI0s7Wn1NUZ751U/LvpLd2dRH0ZL7jQSmsnhlejz2xKNJob/IusY7t9W3ilZLGTCWTwhFB/KSJ58uIjPhm/cwAGK9ZXkrkej1ukv91NTy4p4OOkigr+RWpFZX/0R9MPunPPzU4fnUXqGQ71s0qCYCbwMPSvG66AChBZWmGrjMZO+Z/sOEjR+89WjD8Ka9euZGKkFmjNsikF71o3oOKklcxvjiq6nMM3ORoAcAvMN1u336pTMjkHIAG2Q92KiHsgTOrlQZOU/brDqK/5G7JP7ZUmR/7zcE5LWUjlbifpmDj90Ewwt/qnSSa4B/6p5ZX9zw7bbjySdSjDQ7vdKGAijNXS3LsZmh3UAV7a7He+yykWqJlHGgDDYzI5Lqx5A9AnUaIZtkpd7vWERaDfeI7vkRosThs47WMBGaJu42z74iegmzLkrll2oi9s69oK3v+PneP572iBIj6sgqXI36PB5o2g3qyRrYsw0cnDSUueaTaMwrXhn8AX7dRU9fALTCbPQaHF6v9tt1ECCBtixLERU3LY8ZJcUrj8IgDe994vedf0VX9nN7NpZX3Ot6jWu5zgr0FKZwzW1N+t+IXWSYldGrR7majnswwLtNv8AtYos6jZyS+raUMcax/LpM9kTuQ+i7+jU1FXgmBw0PNPEvG24VB6pIL9Ibk93gasJwKgKPZsWZlxRPygiEqi/AfUzPZ6TGQ8UjSkWQIQEPFEFLu5ty1r6EDQT3LF6o7rxUHFBSxYamLFyaCcGE/dVWCx1LuyEJZbvSGsdDDRgQxSlZ61kYf/UDg1BUP0qNFnxlIDZ1jh4j58="
                }
              + template      = {
                  + metadata = {
                      + annotations = {
                          + "reflector.v1.k8s.emberstack.com/reflection-allowed"            = "true"
                          + "reflector.v1.k8s.emberstack.com/reflection-allowed-namespaces" = "staging"
                          + "reflector.v1.k8s.emberstack.com/reflection-auto-enabled"       = "true"
                          + "reflector.v1.k8s.emberstack.com/reflection-auto-namespaces"    = "staging"
                          + "sealedsecrets.bitnami.com/cluster-wide"                        = "false"
                          + "sealedsecrets.bitnami.com/namespace-wide"                      = "true"
                        }
                      + name        = "auth-service-certs-jwk"
                      + namespace   = "production"
                    }
                  + type     = "Opaque"
                }
            }
        }
      + object   = {
          + apiVersion = "bitnami.com/v1alpha1"
          + kind       = "SealedSecret"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "auth-service-certs-jwk"
              + namespace                  = "production"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + data          = (known after apply)
              + encryptedData = {
                  + "private.key" = "AgCYj3HKJUZ9r4QDQCdraWOVfG70qbKMSjAz+pt0vI6SuTKieZsn9Nsrh/zqwQVqoIWhYSL4/JH+opH2/JelE5AbdtQkt/ettymWRGA9fYz/d3S5gY8R8e6FWLdzMBfhZMsuDTvPrP4XY/G73LueQWNL4laX6+765CE9/uzMVzwpG6txEnEGHCIKvq6RZLpudyLD/JU/U3SEd+PFXmoWI72Sal45H/f0wOdkYG4VkNWsvhGeeHDg+4VlE0apfwD/GTc9IZBTPzZBSayonu+UuIDVDSDXlGuSZby/tIjQAy41v6oBnbXvonj23Ni3NfCX8q8zuIeqjFctwC16pxFyU1sKdVZlh0DBnXjI9UXQveY0xxtrXAdscLSCVbqa1tTw5j3lRyfQOBNcRgIS9d3uJ+7dIKCSHvWB1xEkjIenI2ZU3GeQmPnaScdFhKBZjTp0QJNeNewka3LA1bM4Hqgn8zyX4FmscneNATtc4opAmRxXWXOr16o5Wo9F2w2QoLQIVBIisJymVtA1w1Kp4y/JEQfGnqDBnFo7+dX09IsIjOQryAHHxctjQdVBFt6WRJb8+lPr/41sdSuCmjxHSFo1/712NCC3UrY6Wb/zL4uszOAB2fYDmOVpckZ9mbsvhYcETeBxIy5ck5+PjdzXT9cJoZ19PKiz+DWnQlL0s5HMC1qlPFKZgggCGADQfitqHQGSklnVPTEZQdzyGMPhTDJsGNEkME1vWZvG2q+W5n0NVHBq+/kJVsdXL30YtgqzMsudAabejDXn8G/XVPTRU3+r8ETzIX5ea3HKKCQVvjnBBPz4pzATNAbw0OguyhyJjkhjSZbq5gDSR3NBpTcGMDqA9q/zTiPLf0Y1J0eTssRa5RCtLQxeEM1LN2pKQELV8/jl7NbQhFgG2EsAYEr6Z2uoIRziHfx0DmAjf/JQ0L8y7V+Xq98QdWV2XCIhpLvFZZm8WyDLwJ+JMDpOW7J0DjS7/gzT4Wjj3EA1oIVbm1Y/vzV/lyMAPHqcvYs75P4LO2MBNS5vlYe5ThgSxLvK2RD5pk4xqe/ZIDndCwdaC5vRE94n9kEOuCetxFYeKidFWTJLxFN4jBpQeFvY7olKpINAp0NfNeiOkMud5fTSgoE61mBjIZFzl1uOk+8uO9TUofZflebHqucDaIdv3B7M83ho7XJLyVt4JZ5QkHjoUEd6B01534wt2sc+S9q+fco4hmc3Qc7gYJnddLaEejoAH3+yGD8LCYKEQoYyqlUtQMYuOODauys/xSiFFXELbm//+q9Cg0qi6PuuvS9Ndl+6HW6mYzjR7oxfUPQyCYzp5kfLal5p1PC1yaaNi+77DH7064omX2rJhtAybkaBD5bmfj689tPfRaYOhEL0anP3zp/6QX1QEnPQKmrjQvh0nnXx2o/4DKYqy37TweEPPYj/gjsfnmKE6UC4pf2Aks2CB+hyyNJnOMlCWJFcs5LdIEPr1q3hCFJNLlr8CllGP6o3JwiQj3hXx3aDFC2CE0up25HmVDAV119p5kc8IUcbT272vETVeQSbzyFM8NRaeF7rlgA9mTZPC4Ejo8NdsgrijuhTxLg5XdbzOePPTDc7vZmt58GqDOf46ulIsvUlvwJkamP7pmaZ/SxN/CzLm9zixYwrjBGadshZhqqjjz9ZUd80kcZUh0UIQh70xEyXrqPeu8VkWN/xhqnSxoolFH7g7xfmSbOPfb9s/I3ktS2Hqr/rcKK4zWfxx4Ac0UtxAlRDSYsFF9LYfvuDbnun17rfRRhbio3ZonYEwDOKM7kAX8numLRf5tNH1gMql4NakFGgNrW2+aWUb/S/o8eYDPs9XZbVzAsfGIVzIueyXv/9SppMYfWtEvpGoMwoi3XzhcQxGFvZmoTysgPkGj1qtoM/JdhHOjokqFyvAErHnFPbPf/sranZRqY8mEEhXVi1NFH2di7Pa+6WM2v83JuPIF9CI8cebPXQTnFOWu9WUHyc9Q5tsUY8X7uUrbJyadvCXQI2YrMjMafX5JomzUuOXZVcKalYukTyyhPtCv7UzsbqSSqoI8SKyGJI5HOsvM/r7msZAsqNJjXbbJb3g7+Y25hVPen/D06uHIfc0SftDQZthyIhlWDVMEiAJ0/akCGnWrRKw6AYVPqGOr5+JYaec/T2hboMzsRTP+g4dk6hMXPQOMLJOXzQym8WBFtMkLDpnQ1Ky3gHd/CBCrsKAW49LKHUf9b+eW5fZg/lCynMyHl0MsBMdIcuu/6a1zVBL1+mgGleqnDRxTF3uwW7B+G6jAv+JhZJSHZUg/m41xRD/eD20pM6d1yURWoNhi7QqEuFC7KxsmwZgv1BaEKtbGXDLSGFwIzq8EPvo4BQ3HQy3G+o67SNgV/6toI5EV3S6NKIqp6tsnTzyChBSgnlQZyOXfCutopZW6P4IhM2TB/peG0/lM8yiyjY35Lw8LMqOFmeyFDUwNP6HmmeH9+z5hxYj9k54hiiPyGSih+k/As7428K1UlbaQknjbfKL6Fe59KmTGAM47BUGDlworTdAk+9aWFO7gF4oBlD/GHkwkl4M6S7VXoOE1771/1hb8XPBSTQpGioYPkHErscM1xxjgJlSsDPOhI9tmzzJe+ciE/E3k/1I7dFlJjMYbTPm/l4ADb4nyVF302ctFheFxJPJnbIc9oL+JMyi7kVu5Xtl0xf/N3gFUiHqvWjo+FUwCnkWUSmM9EYoy5xtRBSz5eHgARcbuHt4fARqGuCImyPNBppGwdUoqhmDFIq56zm93wcDdd2mo/5OGSgcnnOkSLBf+X9WuqQEcEz1XVZW8oxu3iYiWb6pdoDzzfYr7Y1u9QHcRTrW8VNtYpt7o1fO+olT6v4E+vyZqe99k1lUPWB/gqkuwFth3qIsch2nJbxVWdO9jiFnlzrbLOfIBvhJqCjtpGg/QrQ8NUAWdZ3gKQa240YnOgjcHGWVmpO12gf2k5jdSotnru6sdsNaSlaio4RI6Q81S4JZd0in3FXQJn1oBU0GaHXIEM51HgXHlFz5R5Oio76iNIbdrJuvFfYMZfmcw2UEKbdUycyblv2FOpx4fvAQneBL2VcdZ/DR/18qExPJBJdTKyLitiwClEC8z8pTPdmxSHKprBQgwhnGlyOSrL961eHBS/co6d9UzJ06igb6KnC2vxlzPDhVqPxeIkMitN/bp5dTPdCBeZnOX1PShof04XZDlmbynyULQZRlC3DgdghPX+JwhbhsKcJ2w5laxKwMerbC4suxMeQ6Eyy8ha04QRRue0fKjQq0uDg3lLRtVs+PPfUev6GudX1yxn3VOLTghF+uOVpkL4DVVPJK0FJKKVRABSXsbkJ+x83hJOhSLu+2wJRzj8SGocmodFHHFj9ZINPMmJWL23liYKWGAztrX6j5Rx3k1Cqt1ttm6wYcwGHYvfBUP7FVyoP6vVGCfWT4XkGD/fCltIuDuf+N3YCf3iYcJqdZOxbwNnz4nl1vsVzwRZRM6rjNMDZmkETBNMVJU4dj1K7AtsyljvzeM1/Upk3ps/AJt2uJBd+S8+yR+pTcCaa3zivxyOJw+jusVyevgHEuhOKtoUAz4g8kftbWaRcp9FxuOCdJA0DxNwrMokFu/oktNvLertHUobsh1+rz2WfjyEcbmEkXRo+LILDpw3Z/LKeEvKXmrhnxoXV+oFejm4g4N5DGroB056plw3CduI/qUbDPjZyK1SHyaDKiUfx2VmN27/LRwpqKYDiu3D2VIfqjTJsEXtBMn+3y+ICWs+b6kUJ2a3MxM5AeS7Iy3Kt//khBJB24CXOhv6+wR7/bUyHbGZdZ0W56Q8sFD2YrgtFJ2EmJ6kSgbrCOoqi7qnPvTmql97/UrCuigVysuURES4yGq6ot+hcb9P2TYif00k2dLefufpGv+TSNKEs7yMXUORctMBfBQGl/nm8FH4UMB30hG5p5Yz6On5wkEOjyRLW0j3ULzO/1DBM9cc+uUfWwvgVT9kjfzVdez6oUQknnBCJ6dTaB+vhe8735cveBvB97U+RzJ3tFhLEKoMF4hNnY4hGLfudU+X4JnKpybK/r0lDuMqoj7EUHKSKesxsK1LtsruQkbC3fJT+2vI35wquSx9noFrOMINtBKk1gHCemcr2NHvdX/zVSRpzqH2/YntIg6R8qdoQFwa+MjpieXKZskfkjdwB3EO5s5f9Sqlm/h8A9l88Sht1BRvUShXzHqQ5CeTIHBITVCA4qrwbGKI1STJ/ux8bK4Gi1tNZ4b55Adzri02MoHdxZx6f1Nmz0yE+3lG9iixFoGmauQR22sPjoO6iSeqXRJdt5qBYRq58o8FeZJ74+ZElyBZSLivnTuyXqcjiHLIS1AVqwxzL0pYshOU4T7pbBjDEfArluAXu3tGFCNtAEZ86XFjIkJZnGzdGGFGJ8BeS7YL3n+BliVcCh7hBR/Zk1EjMm+nCNOhpjV6Mf3Mxs08Z4lXLXRdmwEhbJVDrIjE+q2rIfnGedPctbJOS928rz/VSpOO8H6bF96wFsCSujuDRatkJgPVo3zSJd3JhUsvY1dPoDcnfOQpcm14pkTY5VODbthO2lyGVOnjYWqIjpJhg+/pzUW+H98jUqub5TvJwcTrii4TobhR8tX1SDHqdxrMJe4Jwl7fz3C/vcieVzMXBf8izUhcWgKy34596U9cvyj5ine0xbpKcWk74s4iOM3Drndfoyv2hPi6f8AXGxC2NnYy3O45qbgP4Ol+P4dAegRRg/Lll3QxwqPLPRAkSq4ME40PVEKSKtLM594ejU0+T8m7T43b3N5ntShG9284Tq8bLu/vOGqNsFgg2sngnWbrpEg5iUgQ+jCvB9Gxuuv3uxGK0mGg20JGPRBQf7FIv4Qq+cSw0flj+4AZaq52HeeSW2/T/Vz5qDJzt70XO2Hvv3BymXtIkAKLy6xryQoMlTVu1gcBApIKSxGS/Ay76cMRisyHw33WUFZEY5ezUyFLIdCCmGiluLeUt+5dc2gSrIvssoA3PI67Ty68WyAuxq91VzirsnRp+YO/aFxrZe/HRCZFouK2aBD71OB5WeVFLkfnQFtbU05adTjbGlfuMzgH9x2r84Ohn1rjjVy1b2UsgMCyfoGRPkQl1h3r+toU1msnzPm28aZAsJX3yojJjxCd8XFJWXCJgg6P+d2RZMkOatRfry7fhQLxopCTKsnM8W7eWJGNpP5MLfcdy99rSCLzA9HiHHSW9Kqs/nOMHIiBOsg9Jz+793ZdpqCEzKFYYPuJ+kHMphf3auibKt4IYTd7+ziB3UBn86EhpViqSVbG3GitQkQw+fQEKe8mj0r/QM257n4/2BX95Jf4BhL2QJ6mIZ45KKWv2q3Me5TfHy94Pjzv3DdAiIJohc7rKu43lBNCbWw8pfC+4fFAAUOo5JcB724smVtJXWBrk3hNm1K6gDqak2CT9ybAkKNUQSUnsb/EuyStfOSa4eOSlM2+VdRgOexbksP4s9NI6p98OxMCeTE4J3O8Knla324IiaT26ViGznbImzZ6uucQsbIxx8uspNTQNbdrUnD9T9id413tKu2jlUd0CEpQy0NnGAqj0oQQ9JarEKMOEa0aZx8WYNPKcF1cVEAp8b8Dj/QHGEwFMuqI1+lxsEVFheMUTH992Eq3neWAoOjGn59lv4E0oJ5M/bWGyFBW9ghFbYdzoey47WyySIP9yK61I6JkvjyjKUXZ31nvqYzLVOL6k1CSpF+ySD0eHG66zhda5WU4DZvTAv8lSNHoh5ePOzxCn1wEO78q3JYeXQtvcuYZj/71mVmBVSzJoAzYnOH+N0SJvKSifZk5n46BYZSFyWtPlNWanbbOa/P4ypd2Yi2r1LxCYylgxD3Kiu6snXPRqVte8EwHuJRlyoO/hUg6Aqs+SrgTcdMeIZ8c1O4NGYIesP0bS0r3FFPC//V32+MYd4nqCCsS6q2EC+0hZsq7LHINRnuirAdd1W3r16rlbkPeSFERcf6I+xJIb1GNob8ela6H54FpvuRHz8oEHeZHmjY3+LTD+b+d5M4ZQoxVgnUuuWyhruAH0VBu239FtjjGWw//V355mSOqM8W/HhUgS5qHWxpc+W0baQhXrXOgCt2UpBUziHsXUOGBjdbc2exHFkd/pu9ER+a+8j2tH5sIiJLCRlRPCP9QwTeHoVW0Yg2ortutSe+slz7Dq5EQFL9UhvssStXUAo67bl893iEzOZ5pXIrb9lxI8iv2YE2ICVcQ/OZx0WsFftz9ii+gYPdUsKItXA08L2nA8CIDbitukCZVKXuHU53C488ab87yZy7pdBkHg8vPOT+eSsaSDf+9trfvHb32CFcOn70eK9gtsHI/+aqmU7BpI05gDSza0kDROtzUz/6Vin8bCLmMHVDEGgOOmqyow67+aYAxdQZm/BpMXKg08bM1BC5fxhz+ph4Uo6BUyywbQ/yauwKs3MWS60cGjXw6CWgxpIh1oMKXDBqaNLgwEGeDd3QKO5yrIE+hFY18erzj6mD/2HGPRClequwM7EqzmjoEQlsOpwG3vFvArnp6hyclR5KIuIFR9Hj+2XeJsBmPeHKkogi/grpB9hKQIA23x9lodgHr/QdIsdtJy9fd3EBK7dy4bYBPO6Lg2x7bpsaNNx13pYpried/EW33mBt6DMQCYLpL9Pn4XqbC0pHFTO4VyFJExzOz27sbq1D/E3BFcCxn7BYBFVUHX23QB13O/IL2u271rvwUHNx/sRW7whKLhfvZEmQU2qlUYsk6f2i3GLwy9535A5L0RCditO2/BzugvtIAy2mUSGCSHjEHVFUnAwNcbktnzVjYB1DTOD/oMm2dQqROyOONnY4GUM8vdK2YF3HvXo+z/sKkIaGY0I0TxjsH2edy86uYbbBr0fG8qVjeIfagujlFrMmCPCR2UN/IeHcwubxpwJQvMoKvPIhX5b9PL0dOzwPZ+NR8MTD1ir/+/RHltL51Ahw4ehmmqLgUi08wEHekucoe/8bBJhnzaVUzcJUdoKwEjBdv21eF/jLFDsJVyYm2rwhFUzmBJiQEph1iTNZ6qgzHhfC1yuncCyqBYtK4WotcI0Lab8zS39JNOwXeUSAfIBiF9gkA4rjc8HkSw3LfQ/oYbdxVgNQ7cQi5yDRVc4E928+vn7QCk2NblN7nVWMEjxjpjBVdNDXmspmyvkEzlIJ8pgfPAgA0kZpzu7EJD+1IlLhqVz3QKAMZdQ5JR4tZGyVe2km7rEdwA1LOlDDOOz4fVHC+UJylrRR1/MxjNX8XkXqpttL+kBbaUz0BM8povWVQpXo9KfvOh7nyI/MNxzNQaq1rZEnVQSRmrxumKezH0KUEGE3ZfebPY1yqnu9RE28IGe/l47VQiNO2k61/lIqUFH9dhrrnyigaFx00ugw5naRXsoqfztInqQZM5ZKjgjF41FJB2RV+F2qd/juHqYESkczo6uFM6eh4TdDyftCnbVqC1FXf+hbq8qZGd42E6ouyz6jpa5ANnR/A2MSN5y4iSv06mMMnKb421MxSPX3U51EMz2eX7cvydyClhIPZWZCJvzJmHm0ioVV+qqLpal8e8ATfmeKmekRQsimW8pgkgSplcZXTrJS63+14Rq+ILe9bZi6rLkZgyASYW+VQaVSsKaOXH6W/LXl+fRQQT/QgkZbSKusMPb1YNJiCteTwva5Xd/qowBA0tZ9iTg9ODJ3rMqeHQHdOjSQu0QBxrGC0LXaax+PNDbW7u1sntp7+GnryiYlDWJ5QAYfOrur0EWpgWN1EbAhladgU1wlpLEfwdn/kbkGg7Hvhp7vOG8/kQyKPDfFYvntiJznXN8tYdxCruDQUxYPGv890z1JyvFKyUzdP/KhJj4cD62yocXRsDlXnzuVslCP0vn/i2iU6g/EViGjPPU4yJGRD4tQ8v0a46j8+qdW8/AqEd4qH4MSpr8mnNQ63mqZFXFCB8j+1drMDxHthfIVmT8gozgTMGKb2he1Y/jmHfKK/Yy9P/4TXlYJHzzLZpNUqKxucQJwom2tvEAm1y3fA0ofStE7pI18xQ0FYrRWkkdSu/1HZR69ZlSraICmVq47E0DW81huAI+i/JPieZCJXLHN/YRoo8UNDd8VclMsKP1Dvv6JqzFf3XkovO/9qFj6+U4ny5/bMyEFYH3c4tGVIMyn2t4fTgyd4ribZT09i9XEO5nOdfAdcA0xpVBWiUkB2jdLefvRS7IdpFIR9oBzTJO4MkOJn9649jsp/XTixax/kDWd3dWysMJGh2g6Eg075pNza458/y0plQ+ypYmV4mE7cHMernmRBk5DJxjiHIpKFTvfC7qoOj7IShVoWykGwM4r9ZaH5znSeI/jAwlQ5MfH6E9A3RNHYmhhCNb4jchfnwTFHUnz64GancuYWS4shvo85F9BxRkgB0GN7gb968tLGgbJkp5jgwvVUJR1g3jFjm7ThBt1Wjj6Ik2hc++3JLTCQ6q1zOEB7x8qL9cJk/dYBN7qqvXRNnqjKA+T7ftE+T8csKU5jp+mL8juEAZFX141JWj93nRvImXRLYXiLsDjm72sbP/t07tnYe00whsbrp41UgycGDI1RMKszTYY9cUPISYjwBUvkdMt5u9vqy+bCeknBvnSeScYOYVEatql5Rt2zAuMbiqkapuCsRpi4zcCj3uZFq9CQkyLClQ4tqA/CAIln1Lq4MuK4kzFXPCsPB0nWU+6JCX7HRviusHihys0FyzWHAZm3oEaV+UiB8Wh6QQsPDgROvBP7LGVdmqgKH68jYZ5SFJr8slzLh92sLwt3zutgG8k9oanCKCyLTANOhOH1QO07YBd4oz1Nco1gZG6aTPtEhZ3a2eQfwtqlIdnM1F/7/EfbyCRsDZJqJtM54lkAUL0zhg4cPMhafZoJwXZN7DhJtKaGCnErkcVjKLw7j0w2fOenrbE8rMktOPLEoXB4XRajvak5SiYngK3HUXNKyR7WbYvNcV4tcXOLUlEg9p27Nunh1cxxhI05jLbuipVfADL7sX3c2Ws2K+An0eEfEGi8FN1TiKXytu+6K3aweDY6+/julq/nkpBbi2QAca2DURF27yQPgNUK76kDllNYruvE9aRSCEtmefFa/WbwLSI5vfqE9tQTutqBMnFUewRh2BLJAouNXarj3QXVflXNeYdIA+rrp/3vl0PtnscbSqU+5TEsmYbqOZZLi1aMRSq0Wieju6HZPbxE1gcbanUH/cIhYdlyipg/q+r6YeKuo3kROwAM="
                  + "public.pem"  = "AgAnuZgIj+CO66gGtXNvgTGcE8rWDFHuxcXtr5lhSzV7QD4yxkoo7ED5k2SFFJRxdGkRZq0/bVpObcgVpefimiHliuNCSUWCBbJfChvt5ACuumZHmWE6SIoK+4a4/2qObX+Rfh9vOwjbj0ScakmSrbsrBebwUthIO8APULkTXpaxDljPHOt+bqLe1agDd1qY4KCTCDpbgnLhJ4Fr9zzy1VqC0wV/yh86yAHgnLgicdjWXIOvVpFQmjvLdo4ZLnElEa1Yw9qQwY3KU6U+DmixwaNQQmlkd4ENkADAv9VjStUcGtS0MNTlyRpTw9DHPnFslQlhIK3//n6SBDtGwKv7CajkzxsuumYmehb+HwvgqQ8yAuUND55VcEPGieOWEdYzyaTRt/DWa4B5XLYC8VHeYOLmpJuvwkRsvdyB4iGEy2ymMgJ6gxmmTdG1ow7ojlKWoJI3dNDX8j8ppUPAk3fI+IwDDkEtkMwUibR3QaEk97jHybMkTkpjUuPuy39PZwRlkWd68pUlKjH/3AVBaUz8Xl+m46IVX+9hHGjmWe1gOxq+lsiXtjHulpn4NLgZdZNkJiDAbQy5mjYAEiglREpIwmXal0c/BACU9xv2i2ucPfUtHtfEFPeynNBIcRbifKDe1CWB4QqV4y9qW5AUlu8mGgWX1pshznEm7TCykWH19DiZhLsox5WXlzDuMBYvWSu4vIdK3f8XaotCKXlwgXEwTU/ZJYEwbKdSrd91oSJqc53L+scezfjU8aRn3N+ICFBqjXfRH3zEOq2ZGYs0rQFFoojA/DHcyCNwupaWLY71JL0eUDFapkO63TIW0pEEbRwC9cB6YWiVrWkFAhodT3VxXkvrnfjiyH3v/+ZkUoP7RPT8CHQLWiXB/UeMdKk3cHUXtBnsCYu0/gu3TsqAPQEwNj63hyH5fRhf3/Ns15d7gBK/kCze/DNATtAo3tf0S8lwTIa2WCrI2g6qYei4WL3HrMT1ZnwzXj0Y6OCdvh50yV080UKnvaIgbOUtgF9V9ov7zZ5qsBax8kEFbuU41jQUlYjgYrTYiT23L3LT6dk/qrYKX+/RiYP5AHCX4RkVhjCk+nAFaB+i8KgNH69mRXqJf7HS9VKICtdiJ7J0bBOv6GFzCEBCWI9gddoO4d/ddpGPNYCQaL9vbqmglyAy1FN+n4JF9mjUFMq7mz50EAaKlHOl8ehQ0keIA8sSrzre7kBhgiLVZ6Hhzmt/ad14xyvvnFDIV6Y13N3aYefan6YI1e4ZEneD0gCozC81KwG4RCGUmU2nXWrfhl67Fgdnr9zeifGUXEwklfW09kp9DWTqKHpFyu9ZULJUTp2hxZH3b/N0Mllr69U1JhELgkwfLEWMim6myUeTiHLo89IzD003YLJ9VDcjFET/QD/Ar6vTIrsPP/8l0E7sJKWM22t3ZS6jX0CRNXbzwX5DQPeyVtzaupBCzBaK14feecde9uochnh4D8xF/E4dTwa4r7O5LcT4wXLPImxA7xfblXxY9eja9xv84jn3wLjA9I4VvbOnTws4oifVghtUd0TwcH+43RQDzO9EyV3x2WUgdWmN809qpmZ74UxsyE7Q2FRSgKKC2Zm8G6Uk+N9iidzJt19IWzgbQsTH3c912Odcm1RmE9ceMWQg+lHsgJsZEP/AzPccaX2bWTBJsnvpWiwl1touZq3iSOImv0v5b0mAfPrZTuOaSAkO7iPCj8BV0Fo6dwW89f4KXTRevNBfADVi+ijjhDtoz5JiZzSMct/vAcFOdIvSz1g2U6cdRH9H/34SgV+aNeeDLbkkgOAFO8IUX6eHNOldEilC0xzGMOc8byw4/3Ix53N4E50sXbFL/M+uZwOVx+Jmdb901pIMhQ4Z+3XLheAp+ZXqaI0s7Wn1NUZ751U/LvpLd2dRH0ZL7jQSmsnhlejz2xKNJob/IusY7t9W3ilZLGTCWTwhFB/KSJ58uIjPhm/cwAGK9ZXkrkej1ukv91NTy4p4OOkigr+RWpFZX/0R9MPunPPzU4fnUXqGQ71s0qCYCbwMPSvG66AChBZWmGrjMZO+Z/sOEjR+89WjD8Ka9euZGKkFmjNsikF71o3oOKklcxvjiq6nMM3ORoAcAvMN1u336pTMjkHIAG2Q92KiHsgTOrlQZOU/brDqK/5G7JP7ZUmR/7zcE5LWUjlbifpmDj90Ewwt/qnSSa4B/6p5ZX9zw7bbjySdSjDQ7vdKGAijNXS3LsZmh3UAV7a7He+yykWqJlHGgDDYzI5Lqx5A9AnUaIZtkpd7vWERaDfeI7vkRosThs47WMBGaJu42z74iegmzLkrll2oi9s69oK3v+PneP572iBIj6sgqXI36PB5o2g3qyRrYsw0cnDSUueaTaMwrXhn8AX7dRU9fALTCbPQaHF6v9tt1ECCBtixLERU3LY8ZJcUrj8IgDe994vedf0VX9nN7NpZX3Ot6jWu5zgr0FKZwzW1N+t+IXWSYldGrR7majnswwLtNv8AtYos6jZyS+raUMcax/LpM9kTuQ+i7+jU1FXgmBw0PNPEvG24VB6pIL9Ibk93gasJwKgKPZsWZlxRPygiEqi/AfUzPZ6TGQ8UjSkWQIQEPFEFLu5ty1r6EDQT3LF6o7rxUHFBSxYamLFyaCcGE/dVWCx1LuyEJZbvSGsdDDRgQxSlZ61kYf/UDg1BUP0qNFnxlIDZ1jh4j58="
                }
              + template      = {
                  + data     = (known after apply)
                  + metadata = {
                      + annotations = {
                          + "reflector.v1.k8s.emberstack.com/reflection-allowed"            = "true"
                          + "reflector.v1.k8s.emberstack.com/reflection-allowed-namespaces" = "staging"
                          + "reflector.v1.k8s.emberstack.com/reflection-auto-enabled"       = "true"
                          + "reflector.v1.k8s.emberstack.com/reflection-auto-namespaces"    = "staging"
                          + "sealedsecrets.bitnami.com/cluster-wide"                        = "false"
                          + "sealedsecrets.bitnami.com/namespace-wide"                      = "true"
                        }
                      + name        = "auth-service-certs-jwk"
                      + namespace   = "production"
                    }
                  + type     = "Opaque"
                }
            }
        }
    }

  # module.s42.module.service-token.kubernetes_manifest.sealed_secret["discord-token"] must be replaced
-/+ resource "kubernetes_manifest" "sealed_secret" {
      ~ manifest = {
          ~ spec       = {
              ~ template      = {
                  ~ metadata = {
                      ~ annotations = {
                          ~ "reflector.v1.k8s.emberstack.com/reflection-allowed-namespaces" = "production,staging,previews,sandbox" -> "production,staging,previews"
                          ~ "reflector.v1.k8s.emberstack.com/reflection-auto-namespaces"    = "production,staging,previews,sandbox" -> "production,staging,previews"
                            # (4 unchanged elements hidden)
                        }
                        name        = "discord-token"
                        # (1 unchanged element hidden)
                    } # forces replacement
                    # (1 unchanged element hidden)
                }
                # (1 unchanged element hidden)
            }
            # (3 unchanged elements hidden)
        }
      ~ object   = {
          ~ metadata   = {
              ~ annotations                = {
                  - "sealedsecrets.bitnami.com/cluster-wide"   = "false"
                  - "sealedsecrets.bitnami.com/namespace-wide" = "true"
                } -> (known after apply)
              ~ creationTimestamp          = null -> (known after apply)
              ~ deletionGracePeriodSeconds = null -> (known after apply)
              ~ deletionTimestamp          = null -> (known after apply)
              ~ finalizers                 = null -> (known after apply)
              ~ generateName               = null -> (known after apply)
              ~ generation                 = null -> (known after apply)
              ~ labels                     = null -> (known after apply)
              ~ managedFields              = null -> (known after apply)
                name                       = "discord-token"
              ~ ownerReferences            = null -> (known after apply)
              ~ resourceVersion            = null -> (known after apply)
              ~ selfLink                   = null -> (known after apply)
              ~ uid                        = null -> (known after apply)
                # (1 unchanged element hidden)
            }
          ~ spec       = {
              ~ data          = null -> (known after apply)
              ~ template      = {
                  ~ data     = null -> (known after apply)
                  ~ metadata = {
                      ~ annotations = {
                          ~ "reflector.v1.k8s.emberstack.com/reflection-allowed-namespaces" = "production,staging,previews,sandbox" -> "production,staging,previews"
                          ~ "reflector.v1.k8s.emberstack.com/reflection-auto-namespaces"    = "production,staging,previews,sandbox" -> "production,staging,previews"
                            # (4 unchanged elements hidden)
                        }
                        name        = "discord-token"
                        # (1 unchanged element hidden)
                    }
                    # (1 unchanged element hidden)
                }
                # (1 unchanged element hidden)
            }
            # (2 unchanged elements hidden)
        }
    }

  # module.s42.module.service-token.kubernetes_manifest.sealed_secret["github-token"] must be replaced
-/+ resource "kubernetes_manifest" "sealed_secret" {
      ~ manifest = {
          ~ spec       = {
              ~ template      = {
                  ~ metadata = {
                      ~ annotations = {
                          ~ "reflector.v1.k8s.emberstack.com/reflection-allowed-namespaces" = "production,staging,previews,sandbox" -> "production,staging,previews"
                          ~ "reflector.v1.k8s.emberstack.com/reflection-auto-namespaces"    = "production,staging,previews,sandbox" -> "production,staging,previews"
                            # (4 unchanged elements hidden)
                        }
                        name        = "github-token"
                        # (1 unchanged element hidden)
                    } # forces replacement
                    # (1 unchanged element hidden)
                }
                # (1 unchanged element hidden)
            }
            # (3 unchanged elements hidden)
        }
      ~ object   = {
          ~ metadata   = {
              ~ annotations                = {
                  - "sealedsecrets.bitnami.com/cluster-wide"   = "false"
                  - "sealedsecrets.bitnami.com/namespace-wide" = "true"
                } -> (known after apply)
              ~ creationTimestamp          = null -> (known after apply)
              ~ deletionGracePeriodSeconds = null -> (known after apply)
              ~ deletionTimestamp          = null -> (known after apply)
              ~ finalizers                 = null -> (known after apply)
              ~ generateName               = null -> (known after apply)
              ~ generation                 = null -> (known after apply)
              ~ labels                     = null -> (known after apply)
              ~ managedFields              = null -> (known after apply)
                name                       = "github-token"
              ~ ownerReferences            = null -> (known after apply)
              ~ resourceVersion            = null -> (known after apply)
              ~ selfLink                   = null -> (known after apply)
              ~ uid                        = null -> (known after apply)
                # (1 unchanged element hidden)
            }
          ~ spec       = {
              ~ data          = null -> (known after apply)
              ~ template      = {
                  ~ data     = null -> (known after apply)
                  ~ metadata = {
                      ~ annotations = {
                          ~ "reflector.v1.k8s.emberstack.com/reflection-allowed-namespaces" = "production,staging,previews,sandbox" -> "production,staging,previews"
                          ~ "reflector.v1.k8s.emberstack.com/reflection-auto-namespaces"    = "production,staging,previews,sandbox" -> "production,staging,previews"
                            # (4 unchanged elements hidden)
                        }
                        name        = "github-token"
                        # (1 unchanged element hidden)
                    }
                    # (1 unchanged element hidden)
                }
                # (1 unchanged element hidden)
            }
            # (2 unchanged elements hidden)
        }
    }

  # module.s42.module.service-token.kubernetes_manifest.sealed_secret["jwtks-service-certs-jwk"] will be destroyed
  # (because key ["jwtks-service-certs-jwk"] is not in for_each map)
  - resource "kubernetes_manifest" "sealed_secret" {
      - manifest = {
          - apiVersion = "bitnami.com/v1alpha1"
          - kind       = "SealedSecret"
          - metadata   = {
              - annotations = {
                  - "sealedsecrets.bitnami.com/cluster-wide"   = "false"
                  - "sealedsecrets.bitnami.com/namespace-wide" = "true"
                }
              - name        = "jwtks-service-certs-jwk"
              - namespace   = "production"
            }
          - spec       = {
              - encryptedData = {
                  - "private.key" = "AgB43UqM2XoywjXvcW+C+trq8iEIdA4EuTnZdsGxPLXRg0p7tIKnEg9AtutBuz6f/luqnyxvumBl8cU4q+9/1xzlZHv+NJA2F2Uo1L5w1HjY8NfnAm82o9wnRt3Y38qQMT8WF64C3Rx0S+ivlbOoLwqmSVp2MpE8HXlH7T/UfLF4ifN6YS/uhcwOtcJUMLWdZUfbaqVpLQ4cRypYuoVdaH/G7QsIHf5Bu92XJLfYeAcKznJhZnDZB6xelDm2vIHIuHok3nVjX+Y5BRxOgAWh5IodsJis2T2OUKXohTCVrU+9DiLFp1l1x+kxBsZX/UAB4xYCeJ00S6NyXrt6hBQoN/xFLyGtJkosv9pLemchtWgufyOKtZlTxcou6yVPUfrhi8u8sQvf7RRtMVyDjsRNCXKzWRo+N7y4DGzwIGVHxwqz7mrKKTcBiQ1VIsid8ZtpmXV/rzOGjcEP1PIf8fW6z85ne3p7tx4NCthfM9/ooP2lrMefDG0ywATGes2USt5B90WBJYvAzdYlqp5jLm2wfqwZU2KRd7YgBlZ4qDIFtMTAJXADpJkrEPzHt3IsLzbmvAGja1LcZ52IcaeohvwbKeA5IltJcoY7h907yxfjt9DoJya9soM+Obvb3v96Eyt0piA+lYzg2WZepV1RyWE5oKpLiLSdkbDf6sg9tv0hbdma7id2uqWxO0CrPL2zMTrct/yoO4KBetxNgaZSyZrnrlFS9S/JzQkBUc3cY0546BXs+cD3Pz3sUY3G4LBkLBirDNC4JlG2BkQ5c9GDkfYYj70ehiCeVTxk/YTlRgsmMNMJG6skO5g5bfJPZXTyTJ636avMKsSrOoLIitptcYp3AMA0tw9HL21Epf3wiLF7qaWom+K/Waemuk/LOZaSq3EoQPjLdEgZCT9JIFVxV46ex/nRHCxo++NrE+F5zr7kWIQZvkEucoBR8LBbSzlXNueta6M/cuYRaepYCwrx5PJzr5i4E/sf6RJdnpDThdfTox/OM8Fy75ZIiRYOgoGA2/ExGap8iT4OAhRZmDHhW91StZCKnSotJJr/VRFcwb20QUcsXMmMWtT0wKpLCj5eGjxoMpizW1x/LkJWtBIQbqTOWQGEcvWmogh0el9+yNze4jaZRSIBvjXnuhUNoliEDl2CZMuRoi0sOcpoFJ5+nrrO1aWMhxq6LgMrgSeSUG+S/zmsH/iyMkr3McwREzYf/1LhZhFGMWRtGiYh2ahXTr+Rh0pyJztB0+T2PH88JvYOcyCxY/rIl/l+sBohV7XubgBJlab+dxZQxLEg4QYa2XmoCeIpVpPisI0IdxljXsJxMihrOoWuHnDfqg7RsWosTDQlCMxj9bYVDYIvXi/c2Yy15vknxgaelH9tRxZjYqYhFcnj4cGeITrzRaZTqnwrmcz9ASOsp6ZYofikMGmFTZZegjg5hWiWB+vvU0/m9NEJ5tn72bPpKwLcsm/pLxY35wMQv78me8UoVrEbVQCPbKJs4HWUk9aRMhNt8yv3QehwWFzcYagSBnnWyGkReerry2Gb9TnYK/OPO/eIOCpObiWl9orir987lKGOw5DUyGAhGQuCtXrTig0qUSW3Op7ERY0UX351gcz0cMR5pSmH/mGa5rTwirPCUCcV4qvELjCRpJ4bzP2frzkKFsmV8yKNu/C2juDGo1uE9k1nAZpU30Xrj2kib6HfMec+YUyqwR6MoVKP5NnLkse7OVYqBmABif7cFKFk9wvHmbO05K/Pl1pFvxjLmP7EkfYQWviWzY0IL+34/VSVKYUwhy3rr6j+2refvDpPpi609DIWupLAhB3C57hOzEO9PcbtOTvP7Wox38yz2zfujqUnD/uUlWqOuh3gXFicJyBqrcCJP8pea5y9dMEPbWlKFLSQGOX981p+L8dWA2zlAw+NvvU3yUpdptFNkYbIFR+kt/9TTOa7A8QXQ1lp62qaQ0PGWUupJAsovsHg/iSTDvQoxx3AhKFwx9WoW7M/Yd10r+JaGmEnEkacKjfGrEIDSm6wYeFo8z0b6q3UUErlGAuomVgl3P8+G8lB9//f4nsAFPfJcTGsofvmSt3b88YaX7NrOGVfdVQvSm384SBAuNUEjzdZeHd56HgrwVHdsMtJ9f3ReS43eGpS+yZbM23zDDFv8jTmKeOGnxajBzrP155pNmAsBDd70j0H2ah0jbqgV5nKd2bDXfjfze5VraWanBqE0gb5ZF7grpeEPgExPbNINt2HbObg9IGhROXn7CMEE1RDWJZ2iGSr8U+8mQUvQAKDFU9V7+SbPTtiRr9CPpwQbEN1zN3cPzTgppWpjuKBQiNxiTg8yRUNxBe/cg63Vax/GXE04wCTmFQ3QkeNh9OvBzky1IRQufolKHBp90KJqoUbxuf4BVzui0i4n9HZDjvh2zcy82OeOiRldu/FZizaq0tASMVw4BJ2UXDeoMpiqlBApR5C2mXmRUwXzLQMSYuLB26AcL64WLK4THdBkMJ9l6q2PRcc7+1aY7f3GesMI55LK4S5N32rYlD/vgSUENOYEtOiJOyGarp/lzAModKEb6LHGZxrs1aiagVbOClAJ1gEpTkGyyGfTy8yCjDPq9HbItEzo9Vck6zHtePdIBxPxDkrNTi6bJWzAWEed+XhTJ8beOHXZ2FCy0WQazQz9n3T870jp4PrlTuGlgAzc3vimuqcB2yi+3ZNW4ETG9B+w9S8w5aEiE0Dt3iG2g5UBD3uuIM3eNnluvGRMVwJ8FtfAEM04sixEDfYNoT8qzbSelXxmJYDJqYxZ2s4KiBtnCkiYPjzM6e6NWagaha1/2hW9RKZYDCnvHz57tChiy1anyFCFUt0Y44KNU2VTJLjYPg5cLvW1pmZOh4+rwSl/mW76PbbYz9/RZ8h/3tLiI4vhHODNejV1QT5FlJHUwZtvOaG3lpwwJb+v6LeM0vqFtYLKlaxaUCoOKijVGSxYPopmATmysPBGONAhFLMH1uI+bG81nUBtTwfLLNNK++8na86E0zBouaJIfogbMDeBUWIn+7SHQ/eBijtfHgmoboM4hLWF4knu86ekUJ5ZdfI/94grX2TO2TW3YMg9QongVUUjoARZBvvXXa7HTIwCdHyLjnGOkkgJqXQbpA3huxrZDzVhY1nYDnFf8appba4g7ergvblelky4dJ+6bI3Lzmup4gQ0m7tHGQtej6XyWO9LsyPl50T97nDTwAxGxEZg+uT17iWt31MXc47sNcYpJiNPLnu/KxElWQ9OPU3BxvtwrGklpj5mjYyIf9x6t8C/jl8S8UqtRAxDnwZe1eoFPY3s2DK699KEftxz6Vbo9i2z5VtH6bg7XO9Kz3/RTyafHOOqaonwnfKxPt/HIX7oZs1oWvDrU3qz25LNr2lbWXFaT40RItLoPJo3MOOv9cFHCNj+ebHCj4Yu9ok70pw9t9hYCXFWqHxOrL+PxCPpcOmfNR/DnG1oa4nsYk9WfHMexEyFHGF4LCPHvzka5LamLARUqJRC0LyKGHKsP1Q0SrOZWUEABkT2zyLMll1E2vE8afHfmnbBCpGhuPXucnWyHiNFxhXk0dnB5elX4ZgHXMSuSVmZ1wRwPCPPO2okniwRxGqOT+jUaSGVNM7ZLGegErscpI+UyDU+vpsTzAl3qd+RYecVAcHWvbHXptiqPuuS50tOcXDQsEePPsQHWGJR7WUcuBacTLrlCwRrThJYg1HkhKmABfw32lzAaFLVjgZGeATrNtxkpGvz4w/BbqDScmAIfC9RgPEyixhBunbuJXmnymJg2gu8G7pwoq0D7CrDZ+SiiPsormMIE6czdbQSOCUxVDp9qGyRbUuq8kfihkshwbsOzMfDzCwXIbtNYHKqiiyheQ9PsClw6Ooe+k09PhBMXVIr+w5FEUry+z9GITvVpD0AYCZ+tnFrorbXq/YLc8uB0SsQO0cyMUUAjl3DoDULs+CZU7X/nqh9UEWBLI2jVIpHUvnHTm1uIYn5vT9O6ch3qLFae4sNElGz8m80kVyRD9YovOzfSX11/+fFeBKjFdKHVAeywDbkkfYzkLk5ZDShwiPtGK+ud6GOL2FcXe2Dj+r6Z0uFxPBsyUMhDld0drSwoKLbdcOX9So6k77taYFZDBi0X6BqTPfSKT5vc1erjP0qyS3aE6k3eokY01jstJdUBY6f4HwOysHjmRRYJLmk/LNJ3dtrernoQJJxtIJ9G+rb5oMWklrEfREYqecDs3Ij52whMCEd6zAFujx7V5nT2RJxrIdOfu473fC1New77sN4YjVAFRTLn1qRsE7l54pyRfKhVSUfcsvLw8ABCF0E3VRw9cwASTcrppRwlsujXrqRiTZj7rncXfHxfdZ0gZlrAUJMwlVqoHzJ2x+h8Y2gaS883Skc5dX0kjkUccal4Jp2ndh4eaZL5wTROt3OuNFsy/YtsVqvKp8/5DtI52uWuXh+/W2lg7/sDaa68QBmC0gYJEV7+a0gNV4+n8T9cU91YIfP4QJylo4DkMed23mvGxDMpA6VYvzOPpI3+NVBOVuBASUYoqiqK9Dcag3y2VfRWfsJl3gXTFOrCHOlxTjtP7JYgb69MD8lIsGsCkWxJkJje0VZSRS5s9FjoQFJstncDVr627Cngdk8UxMTqNUJWo9Y5OzvcMiMh0af0BhdwqCLBTfc+ITS69v/KTPgJfQw8/MfP4YlHDSR4MHtIn1b5H2jabS+uRkNG0ZBmPhi2yEv2Uu+EM6YkMeSSloH47fHSSH+gBGZzSZCCJnw1QF2lJpBmzCIlbX/8e8HYhLRxyN4jfVl8vu2Wqw7okAjFNBvAUhyjMnMT800VAF06jJH861mljytzXbqVE7gqt8Cpgj/26E2Wwnui1Q6FsVtHOSpf+oOduxaYa/jGkw4urG+mfESTCNFC2W1R1E9l5vCi4GWX2pN+qxfRAW4SDC/uM7PeBCOHzrIJt7Cu/iKCwr8otuWhPuedXYcmgXvzRj/Y+o68xP2YmW0QmEvRQLsgK0953TTr5A3OAWdaGjs/PSyeZ7+Yty6iG/Ewbn252bf2Ls1ZqDZ/IPDOHCBFdUQ7jLoGC5GVR1wI/d0QLKQDlhysllRPuVxPMhXwm/+j4NRbqP0mM6oR9IeFrR5DB/IWx7ZsJEKhkl/6Z6aaDvd7xOf9ySfO5hcD+HDluIYzZvsQNrYKwBcmb5XvoS00tNPb3RQc1TeEvSmG6sd0zxef7EVw2AXKauk0NycHQKSshjNScNT9NS2S5Be/yl4mCLLanvbgpHCF6Vxb75FOfhTc1Ys9mYxHcBnUDwS6cpatj4Oog6XnkPc2JSHS5xvfi6GSykXazXqSEx8jRZ8pKyoyYNsWa+DwKAtO8fuzysFj4OfbTx5WIbbOC48huf6bBlUfq5ckQ2XlcFVK8aB5xuGE0fb6yhLW+IYZ3hc4jWYiai72cNn7CRHwV1ULeOxt9qSKv8dKlvl57Hn0zYvytna3PqkQ1qG++4mVBDFi86W1nraxK3Q2vsILBcx7JuJVSqzAKg/94jR7bzaOmId7b+/jhcQ+ET1v4szIFhp6vkYNtk+67/wA3IVUM+cKwKqMw5mMk4SrlVjqMcWSkMed8sLKgrVbBhAqBgupnNQjtyFT22WnNeOfMSfzEzrHbTbx3vuj0rC12N0QNHqB0ekmTLB32/st+KKz5DTJdKbcw28M88OePcomdb1QJrV0Y33LniwfztdNK9bWCenIixSj8j1yO5bZiDss4dzsQ5Ydvq4mkUDKtwEz9QYiDJOf5o+L3ia+UigYwNuzTBQMCva+LBeeh+gD0S21jSFlvg0g3PZLPHX32LfLorU1VPO1JGiCcPXJFvVu4KBVr+EM3g2Ku6/hYyqpiNC5Bfs9YmapYh+9bjHr8efC8cPD66W45RDkDZtR+Gr4vJJfqZrBGXXDeT8cJu3yZolEXE2JMSKx3raGAJEyGrDd+mfbCl9etapanqAvkggXa4M6ddtBWb6rIVKz5gMxnMm+a7PcJdayfUu3YdK81nG/rs2OC8rFBkKiGTzTDYrKwtD8OOtCz78dEceMMqXj2PNGzJ85uBEBuTJwdiWiHnTrxfkDCCXM8E2sgJo2AdyPQDVzawAQq9bGDQqedVaBBCDXAb7JIAbIMGpFUSWDIU4PehbR4EV3Ea16BE7LoOkF4i96R9F9ib8+19zxXE9myOWij8JA/wOMAL+fKaHwjcpIxzuE1lDr/sA95FGBFb3tOBSuuIxCS1BkRVp3anNDErD/EP/1TTVALG05zgscnwVLlduX4p2v3cRdEPCOMjlhi00o/5vKtDsyA0Jv7m49GRFIA5ggKSVuNbyCHwE4c8tvwC3vJdH3sX2GnwW7egaSd1P6GEvL2DORxt7/juwr2fKT5tx6m0gLTcniVsrEKnjliUXGH/mGjD6yWffE4HxTE6jwEv0nQkzS9FwVbKowqiKaL10wtR1dOj3wUw3MoImRjsFwY6tbIc7/V0iyGR60OCFfWmG6HHr5bA4dmuOs40gvWqidBqJEhWMk7k2jxKc0VofHvBnjiY1bNHHXdT3dQdCd3Ye3v8IWEsyCpOZ0WHlj6NpQbTexm5uzF793wKiCD8B5bkN/hFQlPALFrtPS7jThJIpTQhp3+lNs448If5FiG2gh9A+5qhjt9LdeNIy90fVJY/4zIeJ9dFgd1PjfAWmlDSODtLfcdiiVmLDiv54sicy5RvSfFFCE02zjDLptpM5c/eTX1aBMVQdXXjUcWypoYSDp04Q8Rgz6ZvMJORWWcao12X7cNoctUUdvI/z3Nf2Y8tuFedFrU80xLAKlWHWLwV+jklqFxx/V5KZUaxzjuupgi2F5TAxv2rdfi2IApjLDL+1uoya5yrX+Rdw708Xxjo6aDofC9lbP66hx5CpQDdd3MLihXtkrfUUUAafwunubTMX/HvtxcPPO80078jsDPrppoaSb0yaVBjIHg9WsJZh89TGgSmGy8VqoZncFR4mq+9AgKgaSYbTctVZnQ2GT+dikTloStkjYVZQaBOtjKxwlMG/PbktwzLBbQrxBSwQTP9ppN8Gi13YZ2qV4rnh5hMwQHUDtRbAyuQ3azU8t8tdwKkkQuYhBwhRQ64FBO8WNPJmisF0cOLCH7oQ0AAAV0A/7OFjGwc9nXqsi45LeKkFH1BpzJl8kpS5PHPOmUAtBTZh3JkpPLnnHEnJKK07zuWdWQzSnuBfnyiWfZcBygEyk6HfvKchIV9MxKwOJHfs6v39qAiff+vlTwlEYIEiW8smSTOi7Rv53Uer9JFWyu8lSGvZm/jfgGS0JewP2UecHQAmFrxkHN8CMwAOPpAFd590BBpo3WDjoJkP92W+1qTENFPTwlNXnEgzs541B66BSOO6YUUywEDaJq+luP8XqaLKm6StLEIdM8czF9GB/Nmf/1jBRzYxR0LAD7o8GuD6jx4Rhf1QnEimspa6dzdhaotlPBPrpvyERr2NKMVIyLMkNp/onQ9Kpc4OQnshKbTUBoXNJdkk6nEckvIhkUjGhFs1fLz4CdVcgV7KArouEutsDwu2JqyMEFmUW/X+rUU8rbx+OLqhrVZpFHPXqoFrS8Ogw6wZ2gxyquM30bJS+aAtNMhxmoWmQEHslJ+7Jjn3+wwcuxW/DkMxOiXRLIQ78OZkXPy6LqoEbYHnxtRjFjYg/693wUmKXW900/gwlLZicOrXlMAFwgpzKpbU5AJlXuhXtoGRcmPdDdMBGJo/NgEqoKMBEkMk9U1p1miDXKLMnYlmTQxZSITP9Sc7TD9cznOC9oGT20qCAt8o+6XaYyz+Gxn6tHDANIw/gpBtpJpWjmjotv6DSTKcMZtrZjxSZR62ZtsoP3VW0Qr4+dEN/1xXuw5h78BuC+CrNSVJ7RjMG68nGHoMvLf+mg0SxqEPpI+AP7IjfOng84qupx37c+DhZp29xFKqwXIbK3GFg3oVQapLoyhzAcEThRzCsxt92uWdwIDIC3K79qs5DzZT3OotbMJPYi7uZkywmUOqXkKeThJU8ETPOtksmdTi9hiZOJr8JU9Iz0HNslTTmCumqZD293N2Y44sKwsrhPaOO65DcXzucTzd5UnGMJahfbbkvpAb4FU3p24QSI/muLL/VBqjGOpuDvHN/TLLv5nyliGB6pGU7JfKur9vHARDpNWVmw6FrBUYryOjBSK+0UMGYj977vOE/s9RX3VcpToG47OoLO61n9W6O54zY0t/zj3Z3Mzu0DShqJlpHrRjS8+c1YYXuwi9c2GaiE4NBVjBjhvydhB8z8qBHkUxwV6cuwj2WtWGG9Y2cgbhs5dHOyjMR3M34l9kNNA1GTiI4ezsm3HqvCd9FRhJmYZUX08OjvQWtgHyUroKaKcd6BhIfUeraeod8hdjZXesY6PL8DZII97QO64b2Q2xggodptSuMqcamvoEwdzS0dH7JzXtlNP2gfrb+bf1cOtVHFT35evChd1aHDUefjDnJYD7pPv9yclBNAlIuUlcOeW3ReZHuzmGui6f7G219fIQ7QvXetuFMDs8lmmgj4aXYV/IUnzQWcAYqmdhvlIg4lWEQ+cc7BlsSkb2X0a/cEgrgsF1sPS2gvLIyLswJDoNkg02B7lA6AAwzgHJGO4FR+bzFehp85i2VN/07hPyaljCywzR0lrO7UcjdSUHN8Hqj1EW2V36GB7a1PImuZeGyYTnYmNwJctMBFSUxWoYIKINMX76k9dT7Zi/724XClNhJ1SXOk2y+LlMYJRkqc4gKlDWOakShh7mVnCIbgRPKg5OVwm2IJILF2L9xpOUUTICyXnFE4eMdWkcHt0CAjmgFE1X5ipYt5tCYHnWiWQQm9+dL+tchYm9xpRlLQQDj5jzS+/iSjfLWoX3vCtdvgrHfYyBbfOekXgZmvoSr2dY8xdjrDQzDjYgsq/tQI+FL0cLCwh4QfYppx+r4SpWsXykfDhDvf70f0XsJ/V51OqHlzolSIJZWAB1N89Hh/3sIa8ysRlVY4m6AwGdNe7HXD5rRlLVyQYEvtwF4WDVY8TwSOoi94GVZrOIIC+IydDzSrnHTZVEAzzDMeYTVTMXeNLesN9K3xew2n3XX4WlDRZDNmw6KmLYku7lmhaBiArmO6hY6HDlFb+6YuENIFlrQ7cj5z9bHRouiVmW8SydBbFAIZicyd7Zs4Zby2T1GQQrTU8Q6s/0SsVFvvgMXsf/EpnkM+s8CBY559ag+GlH1GIQ54UftVx0eW3tPNzWg=="
                  - "public.pem"  = "AgATyLzTSLjFFQGKPe9vJq6l0uKeTw0GOwlWb62odmA8VW+O8+OBqqfyC/zhvClUKG7oJWDMR43ZV/XA5110hSEL24oBn2/uNvZJ3mPKwXBv6Kt/WyBuLaO4sRlCedxfx4W8cdq++nPW8aGs1ToiOvX2H6hNxCbz/QidG1Hw6pyuIxnuilKw4KWLU0yyucpR7lvfSxd3G/ZASwlkoWU6Qr4H57F28GNw/NmUniZVoOChbS89mv4UnuQWNs+i6ASTHjKPQI0hTKVrRCNPD5Axmce3w+7dvoSVs3Prnk0q1OUfnDLdrw2fkG094HmYbZUacfhladxwk4c0dutQ/RIeK2KkSe25KxNMCStWgF7K7g1aFqJlKgFXZr1P/h1KAzksDhIA/AyzUL1QM6H4k/x4hX1Uy+Un+eczsy/xkpMAapgTz/itNPbLsz2WWbeV2YKuJa0Bb6MC2BTUFmGlGj7s4J2KY4YKKohBR4OkC2AVpzO5PcvsA0K9qPhEk24/hj0uheA9/B4k2s7HOsAboJSZsmf1eQA/ylITCsGP6VmA//l//Z+4kLnbVlGR0wdl8wFORsTS24bwfp/afDaAW1E0/nTqyya4VjRCik288Y7Uu4NShiZQ0kmjBICXzdM1nxI/B+VnJ0KtORx2r2ePLvv4MnGpCUyVddf7grCypleW2Yes0P/H+ysIIxQ2Yj9r0eh3/4sklMPkIEHb4Rr63Oy7ROWAlUBRHWXdQB/vkajHo7FtdKE14SDkxhzsn8F4+ifFgGMN1TffWBoY+TnsV6XLxjABkYta1jz9BYe5IQKzbnwXCClWrPQzpjhmD1WlvKO41Ljdqp79D8EdGYA3CSJkB8/jlj0bBVfdKM4lrB6KvYdKopcQO1tCTZKuJBOKFIXDFNuJcARcziQa961OQrRbysgmvE3CvxyXGDbEaSb+7sazqA89rfqecGHUY+0uPrc0sqfMpim97BWOzvqhmBIDFhho0b37Le6BxVVFelqFZikjbS9z5IzCWLH1/cAhMi7iq5IFT1/AEr9uEhq1Cqzom6qCUq4mHtqe8lG0PU2HzgT5y0hwEqmAbAn/AEbpGNVvul7EvvWSO36WMQyGFLltebl2b7Cok6YwipA4RyoJi45lhWZSeLyqM8hKytLgaZVJ179otKsI4YBM70cQ1cnc0d3MWMDtL0+MYE78O9/KIENDgMWvK9uVFUmzz8jlU7wTZ0pFehwGQgSv6RXviu1cnurb26BhHnCfnwH4hkDVeezDgu+sPrKTF2x5PpZDCuEUGdZjGJffwyuKvlLnfScId1xET3+N+KgsZEIGPbVYWQCV0LUYteu7OCZD32oKBxnBU4wP2BMqQVsj+eSDc3xjDr9HvHvR2Lq5Xd06mg9MlostqVz1OmE4Z/WoFNBNaZ3X0MoZxvD7daIOsLgHRaSv6Llgo2fm0DK/ePENahGNpipzO/2AZE0CiSiDUPv/ww144DqfzUYzmffiWscz8ITnwO/szznmQyiEBd8IA3XrMQxZjtDZiJriaxS2tz8Pf6B8YT7Hx6PVJqaIhSId7jPPEmXfAcWLL5uvkHpAwKz8UIHDSHUn8RJxoeQBEzEBvjxnMxq1SNzvPXF20aHFmTVyJorhZgDsBAx8f512YXdXRC+nX3BejICIOK2AUyf2M4OJ1SIFYAAwKCTTJukNBHJcbB0Jv9e3RtLEVt95Qm5ifmF+Of16KeEkjiN0w5vNmFvgUvv04TcdjsKRpKIpVyZ0urNEKGqiNFj/9xT37q3S0GPdpIxUFRxgTsQuBbYTuZO9oPqiou02VTPxH4uR6ygrHr/ZJiAo0qtPzcIsDdxJDaGQyuJUZ+KS4g1mvJvx6KHHSJRyZREiTmqunFO5/lsmb4EVqB+LQXDLVYq5DORds6A73DwzrED3mgatknZDj5xs+NtBjhhOw1bA8/whvJeF4OOELkbLbZUfn/okrmBTDOy9xJcu8d0xubvoO+n0mFZouizcbJdgcaUQW41UiH1FQeAV+kBuBjPnlnViDqMXU/nc9n2jDb2PDOeGAgQoDbuDxpCwKHKAebXHrWEEUVTdQsulMio6smnfol0nBjp8stvn1rMAtCyuoDAHVdgj1S9n8JfduyAngHoLygtPuoP1zGUsIC/q7DBIrGbvhbwDQb5m9EmFVuAAFnPBIcpen4nG4pxglyiVmMy0mWA8ZtiGT+Nu1zcvneDW6ngmmZZNcAYw9M/JOqcZwFQbUwcWXsTVhokdZF0EbGcuQSpEdka8I4Xd4k+napV3nSzR8akXUisr2SVTvDC3WmwuwGat+QaqyCnAjj0sOhnze9SNacSlP0viNyYi87pxycUkpis0NR6CVSNAHPFAgz/M/kjp0YmLrUblAZQSmidym09KZq25uchZc4EJUv7qqlsMMHMOd1SZ2b5JVGPg2vcoN2rVaVVRXTBZ4hQ9Ls14ex/pNHqa5ohh7rCVzvhL5RUkIciLBJLmQmfa5yTpMorR+Xy0Dzt/GX85po3dkheF90Ud+HY/fTaEDD3pi7c25TEV+5RnFglNlHDQbFV3I5itBXljI2uOGpyWYgZFgoXgjr7QOSoOn+oPK8NvPuUp8JEMkjCHasTHoWSvq+z0XQXhu1CTdXO0dld/gVcyTvQNL6bS76fuoKnpWJETB8FFzGUAof71KHg/AKDVWSNpAzKrLGD0tbVFgfSttQ=="
                }
              - template      = {
                  - metadata = {
                      - annotations = {
                          - "reflector.v1.k8s.emberstack.com/reflection-allowed"            = "true"
                          - "reflector.v1.k8s.emberstack.com/reflection-allowed-namespaces" = "staging"
                          - "reflector.v1.k8s.emberstack.com/reflection-auto-enabled"       = "true"
                          - "reflector.v1.k8s.emberstack.com/reflection-auto-namespaces"    = "staging"
                          - "sealedsecrets.bitnami.com/cluster-wide"                        = "false"
                          - "sealedsecrets.bitnami.com/namespace-wide"                      = "true"
                        }
                      - name        = "jwtks-service-certs-jwk"
                      - namespace   = "production"
                    }
                  - type     = "Opaque"
                }
            }
        } -> null
      - object   = {
          - apiVersion = "bitnami.com/v1alpha1"
          - kind       = "SealedSecret"
          - metadata   = {
              - annotations                = {
                  - "sealedsecrets.bitnami.com/cluster-wide"   = "false"
                  - "sealedsecrets.bitnami.com/namespace-wide" = "true"
                }
              - creationTimestamp          = null
              - deletionGracePeriodSeconds = null
              - deletionTimestamp          = null
              - finalizers                 = null
              - generateName               = null
              - generation                 = null
              - labels                     = null
              - managedFields              = null
              - name                       = "jwtks-service-certs-jwk"
              - namespace                  = "production"
              - ownerReferences            = null
              - resourceVersion            = null
              - selfLink                   = null
              - uid                        = null
            }
          - spec       = {
              - data          = null
              - encryptedData = {
                  - "private.key" = "AgB43UqM2XoywjXvcW+C+trq8iEIdA4EuTnZdsGxPLXRg0p7tIKnEg9AtutBuz6f/luqnyxvumBl8cU4q+9/1xzlZHv+NJA2F2Uo1L5w1HjY8NfnAm82o9wnRt3Y38qQMT8WF64C3Rx0S+ivlbOoLwqmSVp2MpE8HXlH7T/UfLF4ifN6YS/uhcwOtcJUMLWdZUfbaqVpLQ4cRypYuoVdaH/G7QsIHf5Bu92XJLfYeAcKznJhZnDZB6xelDm2vIHIuHok3nVjX+Y5BRxOgAWh5IodsJis2T2OUKXohTCVrU+9DiLFp1l1x+kxBsZX/UAB4xYCeJ00S6NyXrt6hBQoN/xFLyGtJkosv9pLemchtWgufyOKtZlTxcou6yVPUfrhi8u8sQvf7RRtMVyDjsRNCXKzWRo+N7y4DGzwIGVHxwqz7mrKKTcBiQ1VIsid8ZtpmXV/rzOGjcEP1PIf8fW6z85ne3p7tx4NCthfM9/ooP2lrMefDG0ywATGes2USt5B90WBJYvAzdYlqp5jLm2wfqwZU2KRd7YgBlZ4qDIFtMTAJXADpJkrEPzHt3IsLzbmvAGja1LcZ52IcaeohvwbKeA5IltJcoY7h907yxfjt9DoJya9soM+Obvb3v96Eyt0piA+lYzg2WZepV1RyWE5oKpLiLSdkbDf6sg9tv0hbdma7id2uqWxO0CrPL2zMTrct/yoO4KBetxNgaZSyZrnrlFS9S/JzQkBUc3cY0546BXs+cD3Pz3sUY3G4LBkLBirDNC4JlG2BkQ5c9GDkfYYj70ehiCeVTxk/YTlRgsmMNMJG6skO5g5bfJPZXTyTJ636avMKsSrOoLIitptcYp3AMA0tw9HL21Epf3wiLF7qaWom+K/Waemuk/LOZaSq3EoQPjLdEgZCT9JIFVxV46ex/nRHCxo++NrE+F5zr7kWIQZvkEucoBR8LBbSzlXNueta6M/cuYRaepYCwrx5PJzr5i4E/sf6RJdnpDThdfTox/OM8Fy75ZIiRYOgoGA2/ExGap8iT4OAhRZmDHhW91StZCKnSotJJr/VRFcwb20QUcsXMmMWtT0wKpLCj5eGjxoMpizW1x/LkJWtBIQbqTOWQGEcvWmogh0el9+yNze4jaZRSIBvjXnuhUNoliEDl2CZMuRoi0sOcpoFJ5+nrrO1aWMhxq6LgMrgSeSUG+S/zmsH/iyMkr3McwREzYf/1LhZhFGMWRtGiYh2ahXTr+Rh0pyJztB0+T2PH88JvYOcyCxY/rIl/l+sBohV7XubgBJlab+dxZQxLEg4QYa2XmoCeIpVpPisI0IdxljXsJxMihrOoWuHnDfqg7RsWosTDQlCMxj9bYVDYIvXi/c2Yy15vknxgaelH9tRxZjYqYhFcnj4cGeITrzRaZTqnwrmcz9ASOsp6ZYofikMGmFTZZegjg5hWiWB+vvU0/m9NEJ5tn72bPpKwLcsm/pLxY35wMQv78me8UoVrEbVQCPbKJs4HWUk9aRMhNt8yv3QehwWFzcYagSBnnWyGkReerry2Gb9TnYK/OPO/eIOCpObiWl9orir987lKGOw5DUyGAhGQuCtXrTig0qUSW3Op7ERY0UX351gcz0cMR5pSmH/mGa5rTwirPCUCcV4qvELjCRpJ4bzP2frzkKFsmV8yKNu/C2juDGo1uE9k1nAZpU30Xrj2kib6HfMec+YUyqwR6MoVKP5NnLkse7OVYqBmABif7cFKFk9wvHmbO05K/Pl1pFvxjLmP7EkfYQWviWzY0IL+34/VSVKYUwhy3rr6j+2refvDpPpi609DIWupLAhB3C57hOzEO9PcbtOTvP7Wox38yz2zfujqUnD/uUlWqOuh3gXFicJyBqrcCJP8pea5y9dMEPbWlKFLSQGOX981p+L8dWA2zlAw+NvvU3yUpdptFNkYbIFR+kt/9TTOa7A8QXQ1lp62qaQ0PGWUupJAsovsHg/iSTDvQoxx3AhKFwx9WoW7M/Yd10r+JaGmEnEkacKjfGrEIDSm6wYeFo8z0b6q3UUErlGAuomVgl3P8+G8lB9//f4nsAFPfJcTGsofvmSt3b88YaX7NrOGVfdVQvSm384SBAuNUEjzdZeHd56HgrwVHdsMtJ9f3ReS43eGpS+yZbM23zDDFv8jTmKeOGnxajBzrP155pNmAsBDd70j0H2ah0jbqgV5nKd2bDXfjfze5VraWanBqE0gb5ZF7grpeEPgExPbNINt2HbObg9IGhROXn7CMEE1RDWJZ2iGSr8U+8mQUvQAKDFU9V7+SbPTtiRr9CPpwQbEN1zN3cPzTgppWpjuKBQiNxiTg8yRUNxBe/cg63Vax/GXE04wCTmFQ3QkeNh9OvBzky1IRQufolKHBp90KJqoUbxuf4BVzui0i4n9HZDjvh2zcy82OeOiRldu/FZizaq0tASMVw4BJ2UXDeoMpiqlBApR5C2mXmRUwXzLQMSYuLB26AcL64WLK4THdBkMJ9l6q2PRcc7+1aY7f3GesMI55LK4S5N32rYlD/vgSUENOYEtOiJOyGarp/lzAModKEb6LHGZxrs1aiagVbOClAJ1gEpTkGyyGfTy8yCjDPq9HbItEzo9Vck6zHtePdIBxPxDkrNTi6bJWzAWEed+XhTJ8beOHXZ2FCy0WQazQz9n3T870jp4PrlTuGlgAzc3vimuqcB2yi+3ZNW4ETG9B+w9S8w5aEiE0Dt3iG2g5UBD3uuIM3eNnluvGRMVwJ8FtfAEM04sixEDfYNoT8qzbSelXxmJYDJqYxZ2s4KiBtnCkiYPjzM6e6NWagaha1/2hW9RKZYDCnvHz57tChiy1anyFCFUt0Y44KNU2VTJLjYPg5cLvW1pmZOh4+rwSl/mW76PbbYz9/RZ8h/3tLiI4vhHODNejV1QT5FlJHUwZtvOaG3lpwwJb+v6LeM0vqFtYLKlaxaUCoOKijVGSxYPopmATmysPBGONAhFLMH1uI+bG81nUBtTwfLLNNK++8na86E0zBouaJIfogbMDeBUWIn+7SHQ/eBijtfHgmoboM4hLWF4knu86ekUJ5ZdfI/94grX2TO2TW3YMg9QongVUUjoARZBvvXXa7HTIwCdHyLjnGOkkgJqXQbpA3huxrZDzVhY1nYDnFf8appba4g7ergvblelky4dJ+6bI3Lzmup4gQ0m7tHGQtej6XyWO9LsyPl50T97nDTwAxGxEZg+uT17iWt31MXc47sNcYpJiNPLnu/KxElWQ9OPU3BxvtwrGklpj5mjYyIf9x6t8C/jl8S8UqtRAxDnwZe1eoFPY3s2DK699KEftxz6Vbo9i2z5VtH6bg7XO9Kz3/RTyafHOOqaonwnfKxPt/HIX7oZs1oWvDrU3qz25LNr2lbWXFaT40RItLoPJo3MOOv9cFHCNj+ebHCj4Yu9ok70pw9t9hYCXFWqHxOrL+PxCPpcOmfNR/DnG1oa4nsYk9WfHMexEyFHGF4LCPHvzka5LamLARUqJRC0LyKGHKsP1Q0SrOZWUEABkT2zyLMll1E2vE8afHfmnbBCpGhuPXucnWyHiNFxhXk0dnB5elX4ZgHXMSuSVmZ1wRwPCPPO2okniwRxGqOT+jUaSGVNM7ZLGegErscpI+UyDU+vpsTzAl3qd+RYecVAcHWvbHXptiqPuuS50tOcXDQsEePPsQHWGJR7WUcuBacTLrlCwRrThJYg1HkhKmABfw32lzAaFLVjgZGeATrNtxkpGvz4w/BbqDScmAIfC9RgPEyixhBunbuJXmnymJg2gu8G7pwoq0D7CrDZ+SiiPsormMIE6czdbQSOCUxVDp9qGyRbUuq8kfihkshwbsOzMfDzCwXIbtNYHKqiiyheQ9PsClw6Ooe+k09PhBMXVIr+w5FEUry+z9GITvVpD0AYCZ+tnFrorbXq/YLc8uB0SsQO0cyMUUAjl3DoDULs+CZU7X/nqh9UEWBLI2jVIpHUvnHTm1uIYn5vT9O6ch3qLFae4sNElGz8m80kVyRD9YovOzfSX11/+fFeBKjFdKHVAeywDbkkfYzkLk5ZDShwiPtGK+ud6GOL2FcXe2Dj+r6Z0uFxPBsyUMhDld0drSwoKLbdcOX9So6k77taYFZDBi0X6BqTPfSKT5vc1erjP0qyS3aE6k3eokY01jstJdUBY6f4HwOysHjmRRYJLmk/LNJ3dtrernoQJJxtIJ9G+rb5oMWklrEfREYqecDs3Ij52whMCEd6zAFujx7V5nT2RJxrIdOfu473fC1New77sN4YjVAFRTLn1qRsE7l54pyRfKhVSUfcsvLw8ABCF0E3VRw9cwASTcrppRwlsujXrqRiTZj7rncXfHxfdZ0gZlrAUJMwlVqoHzJ2x+h8Y2gaS883Skc5dX0kjkUccal4Jp2ndh4eaZL5wTROt3OuNFsy/YtsVqvKp8/5DtI52uWuXh+/W2lg7/sDaa68QBmC0gYJEV7+a0gNV4+n8T9cU91YIfP4QJylo4DkMed23mvGxDMpA6VYvzOPpI3+NVBOVuBASUYoqiqK9Dcag3y2VfRWfsJl3gXTFOrCHOlxTjtP7JYgb69MD8lIsGsCkWxJkJje0VZSRS5s9FjoQFJstncDVr627Cngdk8UxMTqNUJWo9Y5OzvcMiMh0af0BhdwqCLBTfc+ITS69v/KTPgJfQw8/MfP4YlHDSR4MHtIn1b5H2jabS+uRkNG0ZBmPhi2yEv2Uu+EM6YkMeSSloH47fHSSH+gBGZzSZCCJnw1QF2lJpBmzCIlbX/8e8HYhLRxyN4jfVl8vu2Wqw7okAjFNBvAUhyjMnMT800VAF06jJH861mljytzXbqVE7gqt8Cpgj/26E2Wwnui1Q6FsVtHOSpf+oOduxaYa/jGkw4urG+mfESTCNFC2W1R1E9l5vCi4GWX2pN+qxfRAW4SDC/uM7PeBCOHzrIJt7Cu/iKCwr8otuWhPuedXYcmgXvzRj/Y+o68xP2YmW0QmEvRQLsgK0953TTr5A3OAWdaGjs/PSyeZ7+Yty6iG/Ewbn252bf2Ls1ZqDZ/IPDOHCBFdUQ7jLoGC5GVR1wI/d0QLKQDlhysllRPuVxPMhXwm/+j4NRbqP0mM6oR9IeFrR5DB/IWx7ZsJEKhkl/6Z6aaDvd7xOf9ySfO5hcD+HDluIYzZvsQNrYKwBcmb5XvoS00tNPb3RQc1TeEvSmG6sd0zxef7EVw2AXKauk0NycHQKSshjNScNT9NS2S5Be/yl4mCLLanvbgpHCF6Vxb75FOfhTc1Ys9mYxHcBnUDwS6cpatj4Oog6XnkPc2JSHS5xvfi6GSykXazXqSEx8jRZ8pKyoyYNsWa+DwKAtO8fuzysFj4OfbTx5WIbbOC48huf6bBlUfq5ckQ2XlcFVK8aB5xuGE0fb6yhLW+IYZ3hc4jWYiai72cNn7CRHwV1ULeOxt9qSKv8dKlvl57Hn0zYvytna3PqkQ1qG++4mVBDFi86W1nraxK3Q2vsILBcx7JuJVSqzAKg/94jR7bzaOmId7b+/jhcQ+ET1v4szIFhp6vkYNtk+67/wA3IVUM+cKwKqMw5mMk4SrlVjqMcWSkMed8sLKgrVbBhAqBgupnNQjtyFT22WnNeOfMSfzEzrHbTbx3vuj0rC12N0QNHqB0ekmTLB32/st+KKz5DTJdKbcw28M88OePcomdb1QJrV0Y33LniwfztdNK9bWCenIixSj8j1yO5bZiDss4dzsQ5Ydvq4mkUDKtwEz9QYiDJOf5o+L3ia+UigYwNuzTBQMCva+LBeeh+gD0S21jSFlvg0g3PZLPHX32LfLorU1VPO1JGiCcPXJFvVu4KBVr+EM3g2Ku6/hYyqpiNC5Bfs9YmapYh+9bjHr8efC8cPD66W45RDkDZtR+Gr4vJJfqZrBGXXDeT8cJu3yZolEXE2JMSKx3raGAJEyGrDd+mfbCl9etapanqAvkggXa4M6ddtBWb6rIVKz5gMxnMm+a7PcJdayfUu3YdK81nG/rs2OC8rFBkKiGTzTDYrKwtD8OOtCz78dEceMMqXj2PNGzJ85uBEBuTJwdiWiHnTrxfkDCCXM8E2sgJo2AdyPQDVzawAQq9bGDQqedVaBBCDXAb7JIAbIMGpFUSWDIU4PehbR4EV3Ea16BE7LoOkF4i96R9F9ib8+19zxXE9myOWij8JA/wOMAL+fKaHwjcpIxzuE1lDr/sA95FGBFb3tOBSuuIxCS1BkRVp3anNDErD/EP/1TTVALG05zgscnwVLlduX4p2v3cRdEPCOMjlhi00o/5vKtDsyA0Jv7m49GRFIA5ggKSVuNbyCHwE4c8tvwC3vJdH3sX2GnwW7egaSd1P6GEvL2DORxt7/juwr2fKT5tx6m0gLTcniVsrEKnjliUXGH/mGjD6yWffE4HxTE6jwEv0nQkzS9FwVbKowqiKaL10wtR1dOj3wUw3MoImRjsFwY6tbIc7/V0iyGR60OCFfWmG6HHr5bA4dmuOs40gvWqidBqJEhWMk7k2jxKc0VofHvBnjiY1bNHHXdT3dQdCd3Ye3v8IWEsyCpOZ0WHlj6NpQbTexm5uzF793wKiCD8B5bkN/hFQlPALFrtPS7jThJIpTQhp3+lNs448If5FiG2gh9A+5qhjt9LdeNIy90fVJY/4zIeJ9dFgd1PjfAWmlDSODtLfcdiiVmLDiv54sicy5RvSfFFCE02zjDLptpM5c/eTX1aBMVQdXXjUcWypoYSDp04Q8Rgz6ZvMJORWWcao12X7cNoctUUdvI/z3Nf2Y8tuFedFrU80xLAKlWHWLwV+jklqFxx/V5KZUaxzjuupgi2F5TAxv2rdfi2IApjLDL+1uoya5yrX+Rdw708Xxjo6aDofC9lbP66hx5CpQDdd3MLihXtkrfUUUAafwunubTMX/HvtxcPPO80078jsDPrppoaSb0yaVBjIHg9WsJZh89TGgSmGy8VqoZncFR4mq+9AgKgaSYbTctVZnQ2GT+dikTloStkjYVZQaBOtjKxwlMG/PbktwzLBbQrxBSwQTP9ppN8Gi13YZ2qV4rnh5hMwQHUDtRbAyuQ3azU8t8tdwKkkQuYhBwhRQ64FBO8WNPJmisF0cOLCH7oQ0AAAV0A/7OFjGwc9nXqsi45LeKkFH1BpzJl8kpS5PHPOmUAtBTZh3JkpPLnnHEnJKK07zuWdWQzSnuBfnyiWfZcBygEyk6HfvKchIV9MxKwOJHfs6v39qAiff+vlTwlEYIEiW8smSTOi7Rv53Uer9JFWyu8lSGvZm/jfgGS0JewP2UecHQAmFrxkHN8CMwAOPpAFd590BBpo3WDjoJkP92W+1qTENFPTwlNXnEgzs541B66BSOO6YUUywEDaJq+luP8XqaLKm6StLEIdM8czF9GB/Nmf/1jBRzYxR0LAD7o8GuD6jx4Rhf1QnEimspa6dzdhaotlPBPrpvyERr2NKMVIyLMkNp/onQ9Kpc4OQnshKbTUBoXNJdkk6nEckvIhkUjGhFs1fLz4CdVcgV7KArouEutsDwu2JqyMEFmUW/X+rUU8rbx+OLqhrVZpFHPXqoFrS8Ogw6wZ2gxyquM30bJS+aAtNMhxmoWmQEHslJ+7Jjn3+wwcuxW/DkMxOiXRLIQ78OZkXPy6LqoEbYHnxtRjFjYg/693wUmKXW900/gwlLZicOrXlMAFwgpzKpbU5AJlXuhXtoGRcmPdDdMBGJo/NgEqoKMBEkMk9U1p1miDXKLMnYlmTQxZSITP9Sc7TD9cznOC9oGT20qCAt8o+6XaYyz+Gxn6tHDANIw/gpBtpJpWjmjotv6DSTKcMZtrZjxSZR62ZtsoP3VW0Qr4+dEN/1xXuw5h78BuC+CrNSVJ7RjMG68nGHoMvLf+mg0SxqEPpI+AP7IjfOng84qupx37c+DhZp29xFKqwXIbK3GFg3oVQapLoyhzAcEThRzCsxt92uWdwIDIC3K79qs5DzZT3OotbMJPYi7uZkywmUOqXkKeThJU8ETPOtksmdTi9hiZOJr8JU9Iz0HNslTTmCumqZD293N2Y44sKwsrhPaOO65DcXzucTzd5UnGMJahfbbkvpAb4FU3p24QSI/muLL/VBqjGOpuDvHN/TLLv5nyliGB6pGU7JfKur9vHARDpNWVmw6FrBUYryOjBSK+0UMGYj977vOE/s9RX3VcpToG47OoLO61n9W6O54zY0t/zj3Z3Mzu0DShqJlpHrRjS8+c1YYXuwi9c2GaiE4NBVjBjhvydhB8z8qBHkUxwV6cuwj2WtWGG9Y2cgbhs5dHOyjMR3M34l9kNNA1GTiI4ezsm3HqvCd9FRhJmYZUX08OjvQWtgHyUroKaKcd6BhIfUeraeod8hdjZXesY6PL8DZII97QO64b2Q2xggodptSuMqcamvoEwdzS0dH7JzXtlNP2gfrb+bf1cOtVHFT35evChd1aHDUefjDnJYD7pPv9yclBNAlIuUlcOeW3ReZHuzmGui6f7G219fIQ7QvXetuFMDs8lmmgj4aXYV/IUnzQWcAYqmdhvlIg4lWEQ+cc7BlsSkb2X0a/cEgrgsF1sPS2gvLIyLswJDoNkg02B7lA6AAwzgHJGO4FR+bzFehp85i2VN/07hPyaljCywzR0lrO7UcjdSUHN8Hqj1EW2V36GB7a1PImuZeGyYTnYmNwJctMBFSUxWoYIKINMX76k9dT7Zi/724XClNhJ1SXOk2y+LlMYJRkqc4gKlDWOakShh7mVnCIbgRPKg5OVwm2IJILF2L9xpOUUTICyXnFE4eMdWkcHt0CAjmgFE1X5ipYt5tCYHnWiWQQm9+dL+tchYm9xpRlLQQDj5jzS+/iSjfLWoX3vCtdvgrHfYyBbfOekXgZmvoSr2dY8xdjrDQzDjYgsq/tQI+FL0cLCwh4QfYppx+r4SpWsXykfDhDvf70f0XsJ/V51OqHlzolSIJZWAB1N89Hh/3sIa8ysRlVY4m6AwGdNe7HXD5rRlLVyQYEvtwF4WDVY8TwSOoi94GVZrOIIC+IydDzSrnHTZVEAzzDMeYTVTMXeNLesN9K3xew2n3XX4WlDRZDNmw6KmLYku7lmhaBiArmO6hY6HDlFb+6YuENIFlrQ7cj5z9bHRouiVmW8SydBbFAIZicyd7Zs4Zby2T1GQQrTU8Q6s/0SsVFvvgMXsf/EpnkM+s8CBY559ag+GlH1GIQ54UftVx0eW3tPNzWg=="
                  - "public.pem"  = "AgATyLzTSLjFFQGKPe9vJq6l0uKeTw0GOwlWb62odmA8VW+O8+OBqqfyC/zhvClUKG7oJWDMR43ZV/XA5110hSEL24oBn2/uNvZJ3mPKwXBv6Kt/WyBuLaO4sRlCedxfx4W8cdq++nPW8aGs1ToiOvX2H6hNxCbz/QidG1Hw6pyuIxnuilKw4KWLU0yyucpR7lvfSxd3G/ZASwlkoWU6Qr4H57F28GNw/NmUniZVoOChbS89mv4UnuQWNs+i6ASTHjKPQI0hTKVrRCNPD5Axmce3w+7dvoSVs3Prnk0q1OUfnDLdrw2fkG094HmYbZUacfhladxwk4c0dutQ/RIeK2KkSe25KxNMCStWgF7K7g1aFqJlKgFXZr1P/h1KAzksDhIA/AyzUL1QM6H4k/x4hX1Uy+Un+eczsy/xkpMAapgTz/itNPbLsz2WWbeV2YKuJa0Bb6MC2BTUFmGlGj7s4J2KY4YKKohBR4OkC2AVpzO5PcvsA0K9qPhEk24/hj0uheA9/B4k2s7HOsAboJSZsmf1eQA/ylITCsGP6VmA//l//Z+4kLnbVlGR0wdl8wFORsTS24bwfp/afDaAW1E0/nTqyya4VjRCik288Y7Uu4NShiZQ0kmjBICXzdM1nxI/B+VnJ0KtORx2r2ePLvv4MnGpCUyVddf7grCypleW2Yes0P/H+ysIIxQ2Yj9r0eh3/4sklMPkIEHb4Rr63Oy7ROWAlUBRHWXdQB/vkajHo7FtdKE14SDkxhzsn8F4+ifFgGMN1TffWBoY+TnsV6XLxjABkYta1jz9BYe5IQKzbnwXCClWrPQzpjhmD1WlvKO41Ljdqp79D8EdGYA3CSJkB8/jlj0bBVfdKM4lrB6KvYdKopcQO1tCTZKuJBOKFIXDFNuJcARcziQa961OQrRbysgmvE3CvxyXGDbEaSb+7sazqA89rfqecGHUY+0uPrc0sqfMpim97BWOzvqhmBIDFhho0b37Le6BxVVFelqFZikjbS9z5IzCWLH1/cAhMi7iq5IFT1/AEr9uEhq1Cqzom6qCUq4mHtqe8lG0PU2HzgT5y0hwEqmAbAn/AEbpGNVvul7EvvWSO36WMQyGFLltebl2b7Cok6YwipA4RyoJi45lhWZSeLyqM8hKytLgaZVJ179otKsI4YBM70cQ1cnc0d3MWMDtL0+MYE78O9/KIENDgMWvK9uVFUmzz8jlU7wTZ0pFehwGQgSv6RXviu1cnurb26BhHnCfnwH4hkDVeezDgu+sPrKTF2x5PpZDCuEUGdZjGJffwyuKvlLnfScId1xET3+N+KgsZEIGPbVYWQCV0LUYteu7OCZD32oKBxnBU4wP2BMqQVsj+eSDc3xjDr9HvHvR2Lq5Xd06mg9MlostqVz1OmE4Z/WoFNBNaZ3X0MoZxvD7daIOsLgHRaSv6Llgo2fm0DK/ePENahGNpipzO/2AZE0CiSiDUPv/ww144DqfzUYzmffiWscz8ITnwO/szznmQyiEBd8IA3XrMQxZjtDZiJriaxS2tz8Pf6B8YT7Hx6PVJqaIhSId7jPPEmXfAcWLL5uvkHpAwKz8UIHDSHUn8RJxoeQBEzEBvjxnMxq1SNzvPXF20aHFmTVyJorhZgDsBAx8f512YXdXRC+nX3BejICIOK2AUyf2M4OJ1SIFYAAwKCTTJukNBHJcbB0Jv9e3RtLEVt95Qm5ifmF+Of16KeEkjiN0w5vNmFvgUvv04TcdjsKRpKIpVyZ0urNEKGqiNFj/9xT37q3S0GPdpIxUFRxgTsQuBbYTuZO9oPqiou02VTPxH4uR6ygrHr/ZJiAo0qtPzcIsDdxJDaGQyuJUZ+KS4g1mvJvx6KHHSJRyZREiTmqunFO5/lsmb4EVqB+LQXDLVYq5DORds6A73DwzrED3mgatknZDj5xs+NtBjhhOw1bA8/whvJeF4OOELkbLbZUfn/okrmBTDOy9xJcu8d0xubvoO+n0mFZouizcbJdgcaUQW41UiH1FQeAV+kBuBjPnlnViDqMXU/nc9n2jDb2PDOeGAgQoDbuDxpCwKHKAebXHrWEEUVTdQsulMio6smnfol0nBjp8stvn1rMAtCyuoDAHVdgj1S9n8JfduyAngHoLygtPuoP1zGUsIC/q7DBIrGbvhbwDQb5m9EmFVuAAFnPBIcpen4nG4pxglyiVmMy0mWA8ZtiGT+Nu1zcvneDW6ngmmZZNcAYw9M/JOqcZwFQbUwcWXsTVhokdZF0EbGcuQSpEdka8I4Xd4k+napV3nSzR8akXUisr2SVTvDC3WmwuwGat+QaqyCnAjj0sOhnze9SNacSlP0viNyYi87pxycUkpis0NR6CVSNAHPFAgz/M/kjp0YmLrUblAZQSmidym09KZq25uchZc4EJUv7qqlsMMHMOd1SZ2b5JVGPg2vcoN2rVaVVRXTBZ4hQ9Ls14ex/pNHqa5ohh7rCVzvhL5RUkIciLBJLmQmfa5yTpMorR+Xy0Dzt/GX85po3dkheF90Ud+HY/fTaEDD3pi7c25TEV+5RnFglNlHDQbFV3I5itBXljI2uOGpyWYgZFgoXgjr7QOSoOn+oPK8NvPuUp8JEMkjCHasTHoWSvq+z0XQXhu1CTdXO0dld/gVcyTvQNL6bS76fuoKnpWJETB8FFzGUAof71KHg/AKDVWSNpAzKrLGD0tbVFgfSttQ=="
                }
              - template      = {
                  - data     = null
                  - metadata = {
                      - annotations = {
                          - "reflector.v1.k8s.emberstack.com/reflection-allowed"            = "true"
                          - "reflector.v1.k8s.emberstack.com/reflection-allowed-namespaces" = "staging"
                          - "reflector.v1.k8s.emberstack.com/reflection-auto-enabled"       = "true"
                          - "reflector.v1.k8s.emberstack.com/reflection-auto-namespaces"    = "staging"
                          - "sealedsecrets.bitnami.com/cluster-wide"                        = "false"
                          - "sealedsecrets.bitnami.com/namespace-wide"                      = "true"
                        }
                      - name        = "jwtks-service-certs-jwk"
                      - namespace   = "production"
                    }
                  - type     = "Opaque"
                }
            }
        } -> null
    }

  # module.s42.module.service-token.kubernetes_manifest.sealed_secret["oauth2-providers"] must be replaced
-/+ resource "kubernetes_manifest" "sealed_secret" {
      ~ manifest = {
          ~ spec       = {
              ~ template      = {
                  ~ metadata = {
                      ~ annotations = {
                          ~ "reflector.v1.k8s.emberstack.com/reflection-allowed-namespaces" = "staging,previews,sandbox" -> "staging,previews"
                          ~ "reflector.v1.k8s.emberstack.com/reflection-auto-namespaces"    = "staging,previews,sandbox" -> "staging,previews"
                            # (4 unchanged elements hidden)
                        }
                        name        = "oauth2-providers"
                        # (1 unchanged element hidden)
                    } # forces replacement
                    # (1 unchanged element hidden)
                }
                # (1 unchanged element hidden)
            }
            # (3 unchanged elements hidden)
        }
      ~ object   = {
          ~ metadata   = {
              ~ annotations                = {
                  - "sealedsecrets.bitnami.com/cluster-wide"   = "false"
                  - "sealedsecrets.bitnami.com/namespace-wide" = "true"
                } -> (known after apply)
              ~ creationTimestamp          = null -> (known after apply)
              ~ deletionGracePeriodSeconds = null -> (known after apply)
              ~ deletionTimestamp          = null -> (known after apply)
              ~ finalizers                 = null -> (known after apply)
              ~ generateName               = null -> (known after apply)
              ~ generation                 = null -> (known after apply)
              ~ labels                     = null -> (known after apply)
              ~ managedFields              = null -> (known after apply)
                name                       = "oauth2-providers"
              ~ ownerReferences            = null -> (known after apply)
              ~ resourceVersion            = null -> (known after apply)
              ~ selfLink                   = null -> (known after apply)
              ~ uid                        = null -> (known after apply)
                # (1 unchanged element hidden)
            }
          ~ spec       = {
              ~ data          = null -> (known after apply)
              ~ template      = {
                  ~ data     = null -> (known after apply)
                  ~ metadata = {
                      ~ annotations = {
                          ~ "reflector.v1.k8s.emberstack.com/reflection-allowed-namespaces" = "staging,previews,sandbox" -> "staging,previews"
                          ~ "reflector.v1.k8s.emberstack.com/reflection-auto-namespaces"    = "staging,previews,sandbox" -> "staging,previews"
                            # (4 unchanged elements hidden)
                        }
                        name        = "oauth2-providers"
                        # (1 unchanged element hidden)
                    }
                    # (1 unchanged element hidden)
                }
                # (1 unchanged element hidden)
            }
            # (2 unchanged elements hidden)
        }
    }

  # module.s42.module.service-token.kubernetes_manifest.sealed_secret["s42-service-token"] must be replaced
-/+ resource "kubernetes_manifest" "sealed_secret" {
      ~ manifest = {
          ~ spec       = {
              ~ template      = {
                  ~ metadata = {
                      ~ annotations = {
                          ~ "reflector.v1.k8s.emberstack.com/reflection-allowed-namespaces" = "staging,previews,sandbox" -> "staging,previews"
                          ~ "reflector.v1.k8s.emberstack.com/reflection-auto-namespaces"    = "staging,previews,sandbox" -> "staging,previews"
                            # (4 unchanged elements hidden)
                        }
                        name        = "s42-service-token"
                        # (1 unchanged element hidden)
                    } # forces replacement
                    # (1 unchanged element hidden)
                }
                # (1 unchanged element hidden)
            }
            # (3 unchanged elements hidden)
        }
      ~ object   = {
          ~ metadata   = {
              ~ annotations                = {
                  - "sealedsecrets.bitnami.com/cluster-wide"   = "false"
                  - "sealedsecrets.bitnami.com/namespace-wide" = "true"
                } -> (known after apply)
              ~ creationTimestamp          = null -> (known after apply)
              ~ deletionGracePeriodSeconds = null -> (known after apply)
              ~ deletionTimestamp          = null -> (known after apply)
              ~ finalizers                 = null -> (known after apply)
              ~ generateName               = null -> (known after apply)
              ~ generation                 = null -> (known after apply)
              ~ labels                     = null -> (known after apply)
              ~ managedFields              = null -> (known after apply)
                name                       = "s42-service-token"
              ~ ownerReferences            = null -> (known after apply)
              ~ resourceVersion            = null -> (known after apply)
              ~ selfLink                   = null -> (known after apply)
              ~ uid                        = null -> (known after apply)
                # (1 unchanged element hidden)
            }
          ~ spec       = {
              ~ data          = null -> (known after apply)
              ~ template      = {
                  ~ data     = null -> (known after apply)
                  ~ metadata = {
                      ~ annotations = {
                          ~ "reflector.v1.k8s.emberstack.com/reflection-allowed-namespaces" = "staging,previews,sandbox" -> "staging,previews"
                          ~ "reflector.v1.k8s.emberstack.com/reflection-auto-namespaces"    = "staging,previews,sandbox" -> "staging,previews"
                            # (4 unchanged elements hidden)
                        }
                        name        = "s42-service-token"
                        # (1 unchanged element hidden)
                    }
                    # (1 unchanged element hidden)
                }
                # (1 unchanged element hidden)
            }
            # (2 unchanged elements hidden)
        }
    }

  # module.s42.module.service-token.kubernetes_manifest.sealed_secret["sentry-dsns"] must be replaced
-/+ resource "kubernetes_manifest" "sealed_secret" {
      ~ manifest = {
          ~ spec       = {
              ~ encryptedData = { # forces replacement
                  ~ "API_DSN"                = "AgAStueGmlJyOVjLoIT2ofvxgnNr7iSVtITZl27fv/sw31w0MhDluB8O8j2OBi2PDr4sAn+VwKMQqGnIiQiVVaRpp0um2p5VcTSIk/XRvc0LarLsl/ktkrB/RYxO+VQ97m+pHr5H1+IqoqudKA214bQ/KpYuAEYs4n8fjKt6uTXZB9Aj64LJOBO/DLC50ig+0JSoPWY/P9uqHiFmNGBWuXePdffICR0TqZgJn01LEk763ezHoMTAOqhDo4rZI21mYXxjIgjw/nEsVDO13xQdw+ROqsmKDTRZgpioVfoVO6i7c2HcFL7W2lxg4ZD7lVM50kUDdqjL1z+qghDADIxK0zsyVU5TpEbTz5bfBmYdhCWHNyCZih6sZIYtzoMWFNb21UDCipwsOxu+b2JlFk+ODwL5xSKcyhN7SoY61Pkb+1f2Io2u1YMU4Mn2yS38YDsplyhWDZZMCD4gAcxn6EFj8E1ehjZXjuhbc6MEM9clybaWsSd3Y7HHNBKV2A6B5QhKjyhXzfrUSZ4qXmuSGwjFM9P4FFYV90hT3UoMht84aKpqrxQZK5salfJ/HAiUUMRzWknkFXMN9tl0ZbDGFsgD82QDFJ+IjgdDjTK9HSrZaJkrbBs2E6+QEPfkH7sLrpx41r2JF6dJq/7qoRExCefVPABUJuSprmg68Ubg3JCT4QtrWsvQHah9meH3hczR9xjVus02Z/bCFrT3ogaJiVBGQGuWRuv6N0l7LWDMxN7i8hyqJ78mLXZE6Qs1w2wBP3Bai7fVzLdbKrcTSiPLRgrZ/DFKmb4yG8KmC5Op" -> "AgCQ8dI83TvViKYOtTqOhy1leaSlXZM1PJixo6Wt3XBo7GdBaW9YLZA1jBenVDMP972fpxv/So+A+i96IhSnqXiTxucZZLa/mtwtB2KmIwptySPtZEpuNqNvXkcDhRlNWpl/xboFfXRB3CLNWju0k8tJTHDh2bWs8Rw5aEkneACPicvflGsOmnH57hjwX3gD+d5RPecpmMWAv1hafWTtu2EsHQMCMAmFFU/+OCjBseuw6o3ad2c6D1xuoODpIAAQLANhxWqy8ZC6+/UfEY3mA4sDys9jJ0VxydjfsIYryxxN5iCrIB/3bpUWX3I/xxwFYAH7H3aqxVmCbMSdfQaT8aaTCty/Ql01SFrQhxgMSBpQj8MNmNpCxulLa4EqIIPGqs6t6WFYfu9Ig5qoSP+7rQwrlU+A27VmGSMCPYPC+QgWgED7aJtl+DxRkIuD7uR+DTAWdWA2uql4OcBa7Gw5wKI5q+LuQJOL1gDKfVgZ6Yz4oHaAaGuHl1tftgjjZFHV2Q6AkPtFCygTq4OWdfYTP+RKoeR2v1o3Et6eEvFMX8LtKSdNcjqj/l/9zHvehJ+IarFQTuiSO+g7PMDvZv7fDnkn79fbkynI/k4r1y5R6G6FdMwyu4eL+GiKjvFzF5jDmzfix4yLq8ohKT/ZTkcNzajx9uF5tArYlql4muTni2bdLcAQqWFFddzXZG087iczqT3JUtN+MNCO7auBf6Vt7CmToS7u03G7NXIPCI0C6ovoET0RLiKpA3eK9e8zIgC2V8QtHOknTgFlgwFF9DrOwk+CQA4CgRCUyCpR"
                  + "AUTH_SERVICE_DSN"       = "AgCnOKfhjhPobHhI6Ce5IR5Lk9mpx9gfo/lEgHRYZBiAsk9cQhZsCDTQ1CKwYn8jxPQPxMTReBjSPegmIpwxgpS3w1M75NkfSOryuy8c3Y6+kF098VNcYliZhZl/AXdMKXl+EzzCecbKe9dUsDo3wFTScGd5GkFgHhVnPHTV6tbJtsbgjtPRazhTzo5o9WwOvWK01FbNCFJXnOnjJ9hjoBt2joRyI4EPgOWzCv+IyI2v96tFSev8y+bgdXLue5idwf7O3P3P2ldgCLVN1fRQMJIOb/Y4Wo0d/oeS0FuqTi0vAxbk45K31UZRzpdspvez/8F5AIjgEaW8UcVwjbc9p11wXYMIJzDshaxsxQ81nwKb6JaRzHjXJgZ9zEuawEOnEu7lT3alG+1W3esxyfuohp/6CLbCOn9JcN4OMJJZZ3anrNc7genEuUrS6mAISeR7BXJc7ni6uO3LGZCRAXadIjtd60sz+QxmfmKnAifYLMBzVISIQ1f7Jpel3Zh1y0cZ6LIZY+pSmxY9W1lA0MJoBycjIUEoJaaJmWN6JY6xulIw8MZTHoDxZcD4z5Q7nETK6T5fRJlMYnF+zWdu+/OOuZ9CChejwXDJVBeBRq5vP9LW2mE5ivTkcupV9KrtvOGZ+B9Eiw+rcj2ne2JY8kXUk3GA//RU06kNnw4EsKyyC8rUr9WdgtRqiTMVbaV8CRTteGiJItz/lSqAmrf7BSaTGXKOX5POF85Hb6CRubGX7MQAI5IiN1kaESfhU7Nkpn40GdwHzz1o6cxOQVuVSMLIKj41mhXH7aegIiq2"
                  ~ "INTERFACE_DSN"          = "AgCT0mChafJcN917V94P3jrJfx3DJ65V/Xf1IwU/6XEvJLQBP3lgBvtHSF8VYPlfLS7angbVxWlEJd+vejzRfoMMHM6s2CN7qVkZK7tO4EQQ6D/g7g0v7JzlKBQQMtRvsbvTUeUdab5ZYQmVWCu+62pTJTiq38jqq3tdhN2GS1a7IRWtYTUN6R833E4Cnc2MrcCCGpRktN8zR7ZZ8ZYYmipOGoYxXetc6bW+LMzcBOkifL6vAPN4EqV42qUzZFMAt7pw/r5/pNR9eITu7jfnF3QeBaUZh+7Qy6swcVyfFsXg0ilLHSj8DDOtvEQvoVjhZia6uVGVjRquJwKzljMutKhqjTL4Ct2llohJelGQGKkqldJq0L0402PEKEydyJZtPKbJDUTPxq7N4OP0GOoEQNgo6hTR8Kdc3zKZIqRtqt0kPaWuNGu8E2/+kVB0UqVkCDKvsqDztyFsyWrEylISUpaIoaafHAnsxX4eF8SU71LPzHfovfE4KQzK6VuyiVHWh6ApRJ44cMcTMxPeY26qYzyanelupF/pad5kX+9tRTbdi8lW1JpYYz/lU2HfR43PynwJzImQ/m9UT5Qpmc7MkcwPHTk1ymDhbJA7mZ5eKtuGE4mcn8Xrg22NYBo5a//eeiz3vKt+IVMsgKkNIwExg/QWESAeVE5ItHFZvPyedjYfjESuVx145uuNTDMNR1GG+K22p+Oay5OCMzYj7AJpW9z9vC+ALh1bQYwkHA2ajcsexi4FALaTCYyl4E7b0dbd+ax4SSHLyjVOXYtYot2S0CIeKS/EHotlumob" -> "AgAok80KffY5TuaGU5+aMKge9AFGc207UEgapShUwX4O7LT735UrR2frZdTkI/GfYKeGVn23qxI7waiLjcCN/nxqj42B4t/10bkf9g9wUoBUCLE3Mlm64nzHZVRyOeEAgEH0AljZ/0V9zOaa98gKGvBBssWHWvfSTq9kJ9JCkV50RPCaP/u3JQeoAVM8ux47crHtvYxLE5UZjLYexuWq9xPyITGHLwzUDKsegZguRWarLhsaTE18IBK5GW9R4/omv6803gz30+SGoBXqMMXpM1k8tAjRPwNpylCORPQbnepXm2e6HXM3B47/jXgtWbJ3WuWEI3OB9m1PASt0/TBHjQpkmKOhDzh+gu+5lX1NAlLBkgXsSyi9n/teawg5rkfV8aOt8qs1MxXnemDHlIpzNzI0EnxCMdNieFfWzFIn4xY/ijMTWwMGkjH3V3IVXgoh/SB7Ia1UvvP8jMGnhFX2dPFjysJINW7JgyWy6rKrtSosXLIX46g8Swhx8J5iKC9fLZhT4JbcH01jMwPYYEN19Ftt1OSha6mrHljEY3ZssQ0UEfOfXYeo0ssXbUKaHHXRhgBUOmVkxPm/l2nCAhZOYWOEHDaAFbw/VB8RiavmmVpJSnEHeK4fx5QusfHDhJSlBshxqiIokMa3EFpTwXy4veIdZslSya8dphqjpfeQlPlanT8HwP3c1hxnPSMXl7H2u/umpux7hC/XxZxPVMrPoMkasJ2EUZuvLbd2DQQX8djEoEJJdCy/PrSD/FZeRyDLkmZeKLOFIBFE2dLY0RQY9P86X9jOYRO2SnWt"
                  - "JWTKS_SERVICE_DSN"      = "AgBmjxjsYzqckBkIrCOvdpBXzfSzafJepqKCJ27N1Gi9a8xzFFFJYco2VLq9YqzezPRUp6LoHbVCdCr44IxC4vDehWpHs/8B9cy9e9o1o3IBWx1lCSKULB5Dobc4jvZc0ioKj01CnRMYkAM69a0TP6QIgM2wMRF+yPrc56ct1k3krgVoTIep7PYr0c5O2QhDiO21VkeSHD1R1b8A4dnI9h7xPCShIvbmQFLapna05NsrwRrHiD6tRnAPcRugcnksrjkJj/TH8ZSRe77//hyLALFbJx0APTlbURqbMf+o44k+6amYkTJZDLYoZOuoK/gz1Ic1rqRhgIRCGHf2uK1TNovrpGJsBqvAZ53/wj5MBnT6XqT17dvQppXglfaaemqBiWC76McPiqKHRTb+nHXLm106eTVW9Y3/5hwV350gu3V3rKUn/pHMpIJ4AN9IOEJNlXot1IhQ55fB2vOIYMem2xeECSWZ+rwtaqATpjPtM0F96ODa3/ARZ0blSt36Z6sXp4QHK2uWwToTPNUQgTetPXQEZE7Oa5ze7y+Tj5xWF1V17n2EYJ6Hdd3lk0IJ97PbwTWAMugxe1CXwjQmNHBZZf3FUVyTaJwA5CCjXd7XU42MBFDPAOG449cZyTY78cOjESSWRSvuFP6Hu3hNeZmKRiQUUmNAiO9QHJcQoZit2vA7CFct2N4qjuVzJJTuuvF119nzxNZAXnkGQweWG8/HqGBhF4SBF6Og6y1fyj8KGGJj2VtWmB62NxiIqaVX7/c65pFzen97gaEf66/1YRT+1rm+oHvcliSxB4GN" -> null
                  ~ "WEBHOOKS_PROCESSOR_DSN" = "AgCTNFKxePhsbvlVWcKp+jj0YTJWVwTBkpnPTwEwI/4mL3Q6fi4bwwYneU+zvvk3jNHmg3+N72dk0+A+n1b5Av5fcjCS2Ccsc1T99/Bl6aMLYigcQsRgjX+PKNPt0YhL7mB2nfofZb64LMgufg8l+osIge9XkZwORDuZEiTFCDEU1mDDqzo1VnA4SERMKV+tM/S7mW7GtTesh+AcotLPPUHbHBYIyKyZ8OStvKd+0tkNT/9cpZYCfW1Q+IPqQDZSkrZiK2P6FZzFBNmpYbH04eYGjFzRHzPLHs7B4l7yk6MF1lI9qVurBT2DqxmOhCFHtV0IF1gJam8ICy0+8H9xt8EWrUlpR2+vtfewXW5bllqLKGFFJkHSmYgoHFnfAkS6KoZFVXs74/vv5zFuC6pW7qqkk+Ei7HSwHzuvLKKQOSzkwExpwseLqRU77FyAYq4wBe80I7QGNZ0pzf9TEUoi6YkBravmQqNA5X1y6ycW/qq10idJ3SAK0za32FgWx4SF2TytqbYRdeBoGzAnu6VOk6juLbAEl7pmzpEel6OeSI3anrwTYzyP0M3RJ7+j7PQTXSnf/OFSrmblynHVS83HUwbyMpkJSIh3QiVTbe5Z+CgNBMwlVsIVu2MUvFWdy/5fNc9ZyDyC0KE95MKcPYErsXIhe94w+W/kuZrMJ4+JvQPocEOow7ccffK05sj1QyJiY3QNuXV/aHYocTGkEScRJ24CMvXb8o+TaL2Yy2Rv3+VarDK5EtCYUeg0yyqXo9LAPJkp+GDMHKpnc0b8mnpYSvjv2LURvk/Qqp7D" -> "AgDV/ssI7kLLd9P6K3jKiY6XN/eKqI+6c4v0WgG03emSOvP6E/F9qLJlK/nuMQZLz+JQEVswjkL5u6u8UdcrMcLKbgdtP8Px9k+kdglnVnBrZ1UukC4iArSKHj/UAHb2AQbX/yILZrA70MtWEt6NToDaFZhPeg8uUJNxpC4c5Wi6fHIATZ3hsQQNo33WKT2LMjBK1UXBZ1gj9i/SjkVKUpb+RdWPMCtZ8qw1Yh34kt+ayE1O8380B8KODtFvsMpnBsaKbm/ImIOO33VMZpFVSCH2ku+lcLzotDu296+as+MN6MlL+oTwUC1mnVEINW4BBz6sfG8HeTy/I+NCS1F/D+JFzZq6W++6wkocbGPlAofzBRfZQhQLrO/Ht/Zn5ugJNYhrRV7DlOSpALxF39POpMGPVFEV+wn2Fzo9L/6GAu3Id/Uk9hA5icdLA8KuvTih3Jt0SMVf80BqQniJFIUdkSP4qUbSLQ/+VBY8vuATLFqvMxr7OdCsXG8Bc3RT1X/JdSlg8s7Btxmn4G+uCm+9kyfPGyluFzm7TKao7ad+5R3zj22H1j/G43iQEopI03/58PRFk0YnrP6yIm+RYB/HdjOeJIgCYyJkz4IKXcxdSNvYdC9G7X+nt3FO2V/wEuaQi6HNpptSPL0IIDZG5CnFj3tkenwrff6OPPz9S0PplNt8av+kfGTsVyCPB9i/qAtvYP6bYXV+SJVRiaQ+lL/0W9WrhhsyiY9mZgRELtS4kgMI9Dy3nL4LOOl1xRXUSWNkVYV+ESZSJzh+AFQ5OXBUcQnASSOIkReq4ody"
                }
              ~ template      = {
                  ~ metadata = {
                      ~ annotations = {
                          ~ "reflector.v1.k8s.emberstack.com/reflection-allowed-namespaces" = "staging,previews,sandbox" -> "staging,previews"
                          ~ "reflector.v1.k8s.emberstack.com/reflection-auto-namespaces"    = "staging,previews,sandbox" -> "staging,previews"
                            # (4 unchanged elements hidden)
                        }
                        name        = "sentry-dsns"
                        # (1 unchanged element hidden)
                    } # forces replacement
                    # (1 unchanged element hidden)
                }
            }
            # (3 unchanged elements hidden)
        }
      ~ object   = {
          ~ metadata   = {
              ~ annotations                = {
                  - "sealedsecrets.bitnami.com/cluster-wide"   = "false"
                  - "sealedsecrets.bitnami.com/namespace-wide" = "true"
                } -> (known after apply)
              ~ creationTimestamp          = null -> (known after apply)
              ~ deletionGracePeriodSeconds = null -> (known after apply)
              ~ deletionTimestamp          = null -> (known after apply)
              ~ finalizers                 = null -> (known after apply)
              ~ generateName               = null -> (known after apply)
              ~ generation                 = null -> (known after apply)
              ~ labels                     = null -> (known after apply)
              ~ managedFields              = null -> (known after apply)
                name                       = "sentry-dsns"
              ~ ownerReferences            = null -> (known after apply)
              ~ resourceVersion            = null -> (known after apply)
              ~ selfLink                   = null -> (known after apply)
              ~ uid                        = null -> (known after apply)
                # (1 unchanged element hidden)
            }
          ~ spec       = {
              ~ data          = null -> (known after apply)
              ~ encryptedData = {
                  ~ "API_DSN"                = "AgAStueGmlJyOVjLoIT2ofvxgnNr7iSVtITZl27fv/sw31w0MhDluB8O8j2OBi2PDr4sAn+VwKMQqGnIiQiVVaRpp0um2p5VcTSIk/XRvc0LarLsl/ktkrB/RYxO+VQ97m+pHr5H1+IqoqudKA214bQ/KpYuAEYs4n8fjKt6uTXZB9Aj64LJOBO/DLC50ig+0JSoPWY/P9uqHiFmNGBWuXePdffICR0TqZgJn01LEk763ezHoMTAOqhDo4rZI21mYXxjIgjw/nEsVDO13xQdw+ROqsmKDTRZgpioVfoVO6i7c2HcFL7W2lxg4ZD7lVM50kUDdqjL1z+qghDADIxK0zsyVU5TpEbTz5bfBmYdhCWHNyCZih6sZIYtzoMWFNb21UDCipwsOxu+b2JlFk+ODwL5xSKcyhN7SoY61Pkb+1f2Io2u1YMU4Mn2yS38YDsplyhWDZZMCD4gAcxn6EFj8E1ehjZXjuhbc6MEM9clybaWsSd3Y7HHNBKV2A6B5QhKjyhXzfrUSZ4qXmuSGwjFM9P4FFYV90hT3UoMht84aKpqrxQZK5salfJ/HAiUUMRzWknkFXMN9tl0ZbDGFsgD82QDFJ+IjgdDjTK9HSrZaJkrbBs2E6+QEPfkH7sLrpx41r2JF6dJq/7qoRExCefVPABUJuSprmg68Ubg3JCT4QtrWsvQHah9meH3hczR9xjVus02Z/bCFrT3ogaJiVBGQGuWRuv6N0l7LWDMxN7i8hyqJ78mLXZE6Qs1w2wBP3Bai7fVzLdbKrcTSiPLRgrZ/DFKmb4yG8KmC5Op" -> "AgCQ8dI83TvViKYOtTqOhy1leaSlXZM1PJixo6Wt3XBo7GdBaW9YLZA1jBenVDMP972fpxv/So+A+i96IhSnqXiTxucZZLa/mtwtB2KmIwptySPtZEpuNqNvXkcDhRlNWpl/xboFfXRB3CLNWju0k8tJTHDh2bWs8Rw5aEkneACPicvflGsOmnH57hjwX3gD+d5RPecpmMWAv1hafWTtu2EsHQMCMAmFFU/+OCjBseuw6o3ad2c6D1xuoODpIAAQLANhxWqy8ZC6+/UfEY3mA4sDys9jJ0VxydjfsIYryxxN5iCrIB/3bpUWX3I/xxwFYAH7H3aqxVmCbMSdfQaT8aaTCty/Ql01SFrQhxgMSBpQj8MNmNpCxulLa4EqIIPGqs6t6WFYfu9Ig5qoSP+7rQwrlU+A27VmGSMCPYPC+QgWgED7aJtl+DxRkIuD7uR+DTAWdWA2uql4OcBa7Gw5wKI5q+LuQJOL1gDKfVgZ6Yz4oHaAaGuHl1tftgjjZFHV2Q6AkPtFCygTq4OWdfYTP+RKoeR2v1o3Et6eEvFMX8LtKSdNcjqj/l/9zHvehJ+IarFQTuiSO+g7PMDvZv7fDnkn79fbkynI/k4r1y5R6G6FdMwyu4eL+GiKjvFzF5jDmzfix4yLq8ohKT/ZTkcNzajx9uF5tArYlql4muTni2bdLcAQqWFFddzXZG087iczqT3JUtN+MNCO7auBf6Vt7CmToS7u03G7NXIPCI0C6ovoET0RLiKpA3eK9e8zIgC2V8QtHOknTgFlgwFF9DrOwk+CQA4CgRCUyCpR"
                  + "AUTH_SERVICE_DSN"       = "AgCnOKfhjhPobHhI6Ce5IR5Lk9mpx9gfo/lEgHRYZBiAsk9cQhZsCDTQ1CKwYn8jxPQPxMTReBjSPegmIpwxgpS3w1M75NkfSOryuy8c3Y6+kF098VNcYliZhZl/AXdMKXl+EzzCecbKe9dUsDo3wFTScGd5GkFgHhVnPHTV6tbJtsbgjtPRazhTzo5o9WwOvWK01FbNCFJXnOnjJ9hjoBt2joRyI4EPgOWzCv+IyI2v96tFSev8y+bgdXLue5idwf7O3P3P2ldgCLVN1fRQMJIOb/Y4Wo0d/oeS0FuqTi0vAxbk45K31UZRzpdspvez/8F5AIjgEaW8UcVwjbc9p11wXYMIJzDshaxsxQ81nwKb6JaRzHjXJgZ9zEuawEOnEu7lT3alG+1W3esxyfuohp/6CLbCOn9JcN4OMJJZZ3anrNc7genEuUrS6mAISeR7BXJc7ni6uO3LGZCRAXadIjtd60sz+QxmfmKnAifYLMBzVISIQ1f7Jpel3Zh1y0cZ6LIZY+pSmxY9W1lA0MJoBycjIUEoJaaJmWN6JY6xulIw8MZTHoDxZcD4z5Q7nETK6T5fRJlMYnF+zWdu+/OOuZ9CChejwXDJVBeBRq5vP9LW2mE5ivTkcupV9KrtvOGZ+B9Eiw+rcj2ne2JY8kXUk3GA//RU06kNnw4EsKyyC8rUr9WdgtRqiTMVbaV8CRTteGiJItz/lSqAmrf7BSaTGXKOX5POF85Hb6CRubGX7MQAI5IiN1kaESfhU7Nkpn40GdwHzz1o6cxOQVuVSMLIKj41mhXH7aegIiq2"
                  ~ "INTERFACE_DSN"          = "AgCT0mChafJcN917V94P3jrJfx3DJ65V/Xf1IwU/6XEvJLQBP3lgBvtHSF8VYPlfLS7angbVxWlEJd+vejzRfoMMHM6s2CN7qVkZK7tO4EQQ6D/g7g0v7JzlKBQQMtRvsbvTUeUdab5ZYQmVWCu+62pTJTiq38jqq3tdhN2GS1a7IRWtYTUN6R833E4Cnc2MrcCCGpRktN8zR7ZZ8ZYYmipOGoYxXetc6bW+LMzcBOkifL6vAPN4EqV42qUzZFMAt7pw/r5/pNR9eITu7jfnF3QeBaUZh+7Qy6swcVyfFsXg0ilLHSj8DDOtvEQvoVjhZia6uVGVjRquJwKzljMutKhqjTL4Ct2llohJelGQGKkqldJq0L0402PEKEydyJZtPKbJDUTPxq7N4OP0GOoEQNgo6hTR8Kdc3zKZIqRtqt0kPaWuNGu8E2/+kVB0UqVkCDKvsqDztyFsyWrEylISUpaIoaafHAnsxX4eF8SU71LPzHfovfE4KQzK6VuyiVHWh6ApRJ44cMcTMxPeY26qYzyanelupF/pad5kX+9tRTbdi8lW1JpYYz/lU2HfR43PynwJzImQ/m9UT5Qpmc7MkcwPHTk1ymDhbJA7mZ5eKtuGE4mcn8Xrg22NYBo5a//eeiz3vKt+IVMsgKkNIwExg/QWESAeVE5ItHFZvPyedjYfjESuVx145uuNTDMNR1GG+K22p+Oay5OCMzYj7AJpW9z9vC+ALh1bQYwkHA2ajcsexi4FALaTCYyl4E7b0dbd+ax4SSHLyjVOXYtYot2S0CIeKS/EHotlumob" -> "AgAok80KffY5TuaGU5+aMKge9AFGc207UEgapShUwX4O7LT735UrR2frZdTkI/GfYKeGVn23qxI7waiLjcCN/nxqj42B4t/10bkf9g9wUoBUCLE3Mlm64nzHZVRyOeEAgEH0AljZ/0V9zOaa98gKGvBBssWHWvfSTq9kJ9JCkV50RPCaP/u3JQeoAVM8ux47crHtvYxLE5UZjLYexuWq9xPyITGHLwzUDKsegZguRWarLhsaTE18IBK5GW9R4/omv6803gz30+SGoBXqMMXpM1k8tAjRPwNpylCORPQbnepXm2e6HXM3B47/jXgtWbJ3WuWEI3OB9m1PASt0/TBHjQpkmKOhDzh+gu+5lX1NAlLBkgXsSyi9n/teawg5rkfV8aOt8qs1MxXnemDHlIpzNzI0EnxCMdNieFfWzFIn4xY/ijMTWwMGkjH3V3IVXgoh/SB7Ia1UvvP8jMGnhFX2dPFjysJINW7JgyWy6rKrtSosXLIX46g8Swhx8J5iKC9fLZhT4JbcH01jMwPYYEN19Ftt1OSha6mrHljEY3ZssQ0UEfOfXYeo0ssXbUKaHHXRhgBUOmVkxPm/l2nCAhZOYWOEHDaAFbw/VB8RiavmmVpJSnEHeK4fx5QusfHDhJSlBshxqiIokMa3EFpTwXy4veIdZslSya8dphqjpfeQlPlanT8HwP3c1hxnPSMXl7H2u/umpux7hC/XxZxPVMrPoMkasJ2EUZuvLbd2DQQX8djEoEJJdCy/PrSD/FZeRyDLkmZeKLOFIBFE2dLY0RQY9P86X9jOYRO2SnWt"
                  - "JWTKS_SERVICE_DSN"      = "AgBmjxjsYzqckBkIrCOvdpBXzfSzafJepqKCJ27N1Gi9a8xzFFFJYco2VLq9YqzezPRUp6LoHbVCdCr44IxC4vDehWpHs/8B9cy9e9o1o3IBWx1lCSKULB5Dobc4jvZc0ioKj01CnRMYkAM69a0TP6QIgM2wMRF+yPrc56ct1k3krgVoTIep7PYr0c5O2QhDiO21VkeSHD1R1b8A4dnI9h7xPCShIvbmQFLapna05NsrwRrHiD6tRnAPcRugcnksrjkJj/TH8ZSRe77//hyLALFbJx0APTlbURqbMf+o44k+6amYkTJZDLYoZOuoK/gz1Ic1rqRhgIRCGHf2uK1TNovrpGJsBqvAZ53/wj5MBnT6XqT17dvQppXglfaaemqBiWC76McPiqKHRTb+nHXLm106eTVW9Y3/5hwV350gu3V3rKUn/pHMpIJ4AN9IOEJNlXot1IhQ55fB2vOIYMem2xeECSWZ+rwtaqATpjPtM0F96ODa3/ARZ0blSt36Z6sXp4QHK2uWwToTPNUQgTetPXQEZE7Oa5ze7y+Tj5xWF1V17n2EYJ6Hdd3lk0IJ97PbwTWAMugxe1CXwjQmNHBZZf3FUVyTaJwA5CCjXd7XU42MBFDPAOG449cZyTY78cOjESSWRSvuFP6Hu3hNeZmKRiQUUmNAiO9QHJcQoZit2vA7CFct2N4qjuVzJJTuuvF119nzxNZAXnkGQweWG8/HqGBhF4SBF6Og6y1fyj8KGGJj2VtWmB62NxiIqaVX7/c65pFzen97gaEf66/1YRT+1rm+oHvcliSxB4GN" -> null
                  ~ "WEBHOOKS_PROCESSOR_DSN" = "AgCTNFKxePhsbvlVWcKp+jj0YTJWVwTBkpnPTwEwI/4mL3Q6fi4bwwYneU+zvvk3jNHmg3+N72dk0+A+n1b5Av5fcjCS2Ccsc1T99/Bl6aMLYigcQsRgjX+PKNPt0YhL7mB2nfofZb64LMgufg8l+osIge9XkZwORDuZEiTFCDEU1mDDqzo1VnA4SERMKV+tM/S7mW7GtTesh+AcotLPPUHbHBYIyKyZ8OStvKd+0tkNT/9cpZYCfW1Q+IPqQDZSkrZiK2P6FZzFBNmpYbH04eYGjFzRHzPLHs7B4l7yk6MF1lI9qVurBT2DqxmOhCFHtV0IF1gJam8ICy0+8H9xt8EWrUlpR2+vtfewXW5bllqLKGFFJkHSmYgoHFnfAkS6KoZFVXs74/vv5zFuC6pW7qqkk+Ei7HSwHzuvLKKQOSzkwExpwseLqRU77FyAYq4wBe80I7QGNZ0pzf9TEUoi6YkBravmQqNA5X1y6ycW/qq10idJ3SAK0za32FgWx4SF2TytqbYRdeBoGzAnu6VOk6juLbAEl7pmzpEel6OeSI3anrwTYzyP0M3RJ7+j7PQTXSnf/OFSrmblynHVS83HUwbyMpkJSIh3QiVTbe5Z+CgNBMwlVsIVu2MUvFWdy/5fNc9ZyDyC0KE95MKcPYErsXIhe94w+W/kuZrMJ4+JvQPocEOow7ccffK05sj1QyJiY3QNuXV/aHYocTGkEScRJ24CMvXb8o+TaL2Yy2Rv3+VarDK5EtCYUeg0yyqXo9LAPJkp+GDMHKpnc0b8mnpYSvjv2LURvk/Qqp7D" -> "AgDV/ssI7kLLd9P6K3jKiY6XN/eKqI+6c4v0WgG03emSOvP6E/F9qLJlK/nuMQZLz+JQEVswjkL5u6u8UdcrMcLKbgdtP8Px9k+kdglnVnBrZ1UukC4iArSKHj/UAHb2AQbX/yILZrA70MtWEt6NToDaFZhPeg8uUJNxpC4c5Wi6fHIATZ3hsQQNo33WKT2LMjBK1UXBZ1gj9i/SjkVKUpb+RdWPMCtZ8qw1Yh34kt+ayE1O8380B8KODtFvsMpnBsaKbm/ImIOO33VMZpFVSCH2ku+lcLzotDu296+as+MN6MlL+oTwUC1mnVEINW4BBz6sfG8HeTy/I+NCS1F/D+JFzZq6W++6wkocbGPlAofzBRfZQhQLrO/Ht/Zn5ugJNYhrRV7DlOSpALxF39POpMGPVFEV+wn2Fzo9L/6GAu3Id/Uk9hA5icdLA8KuvTih3Jt0SMVf80BqQniJFIUdkSP4qUbSLQ/+VBY8vuATLFqvMxr7OdCsXG8Bc3RT1X/JdSlg8s7Btxmn4G+uCm+9kyfPGyluFzm7TKao7ad+5R3zj22H1j/G43iQEopI03/58PRFk0YnrP6yIm+RYB/HdjOeJIgCYyJkz4IKXcxdSNvYdC9G7X+nt3FO2V/wEuaQi6HNpptSPL0IIDZG5CnFj3tkenwrff6OPPz9S0PplNt8av+kfGTsVyCPB9i/qAtvYP6bYXV+SJVRiaQ+lL/0W9WrhhsyiY9mZgRELtS4kgMI9Dy3nL4LOOl1xRXUSWNkVYV+ESZSJzh+AFQ5OXBUcQnASSOIkReq4ody"
                }
              ~ template      = {
                  ~ data     = null -> (known after apply)
                  ~ metadata = {
                      ~ annotations = {
                          ~ "reflector.v1.k8s.emberstack.com/reflection-allowed-namespaces" = "staging,previews,sandbox" -> "staging,previews"
                          ~ "reflector.v1.k8s.emberstack.com/reflection-auto-namespaces"    = "staging,previews,sandbox" -> "staging,previews"
                            # (4 unchanged elements hidden)
                        }
                        name        = "sentry-dsns"
                        # (1 unchanged element hidden)
                    }
                    # (1 unchanged element hidden)
                }
            }
            # (2 unchanged elements hidden)
        }
    }

  # module.s42.module.webhooks_processor.kubernetes_deployment.app[0] will be updated in-place
  ~ resource "kubernetes_deployment" "app" {
        id               = "production/webhooks-processor"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.24.4" -> "latest"
              ~ "version"                      = "v0.24.4" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "webhooks-processor"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ metadata {
                  ~ labels      = {
                      ~ "version"                      = "v0.24.4" -> "latest"
                        # (5 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (12 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "ghcr.io/42atomys/stud42:v0.24.4" -> "ghcr.io/42atomys/stud42:latest"
                        name                       = "webhooks-processor"
                        # (8 unchanged attributes hidden)

                        # (20 unchanged blocks hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.s42.module.webhooks_processor.kubernetes_horizontal_pod_autoscaler_v2.app[0] will be updated in-place
  ~ resource "kubernetes_horizontal_pod_autoscaler_v2" "app" {
        id = "production/webhooks-processor"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.24.4" -> "latest"
              ~ "version"                      = "v0.24.4" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "webhooks-processor"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 9 to add, 12 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: apps-tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "apps-tfplan"

```
</details>